#include "Menu.h"
#include "DayMgr.h"
#include "Graphics.h"
#include "sysNew.h"
#include "gameflow.h"
#include "MapMgr.h"
#include "NaviMgr.h"
#include "DebugLog.h"
#include "Controller.h"

/*
 * --INFO--
 * Address:	........
 * Size:	00009C
 */
DEFINE_ERROR(__LINE__) // Never used in the DLL

/*
 * --INFO--
 * Address:	........
 * Size:	0000C8
 */
DEFINE_PRINT(nullptr) //! TODO: Why is the size not proper?

/**
 * @brief TODO
 */
struct PositionMenu : public Menu {
	void menuDecrease(Menu& menu)
	{
		if (!mIsSmallAdjustment) {
			*mComponentValue -= 10.0f;
			updateComponent(menu, mComponentName, mComponentValue);
		} else {
			*mComponentValue -= 0.01f;
			updateComponent(menu, mComponentName, mComponentValue);
		}
	}
	void menuIncrease(Menu& menu)
	{
		if (!mIsSmallAdjustment) {
			*mComponentValue += 10.0f;
			updateComponent(menu, mComponentName, mComponentValue);
		} else {
			*mComponentValue += 0.01f;
			updateComponent(menu, mComponentName, mComponentValue);
		}
	}

	void menuEnterX(Menu& menu)
	{
		mComponentValue = &mPosition->x;
		mComponentName  = "X";

		updateComponent(menu, mComponentName, mComponentValue);
	}
	void menuEnterY(Menu& menu)
	{
		mComponentValue = &mPosition->y;
		mComponentName  = "Y";

		updateComponent(menu, mComponentName, mComponentValue);
	}
	void menuEnterZ(Menu& menu)
	{
		mComponentValue = &mPosition->z;
		mComponentName  = "Z";

		updateComponent(menu, mComponentName, mComponentValue);
	}

	PositionMenu(Vector3f* pos, Controller* controller, Font* font, bool p4, bool smlAdjust)
	    : Menu(controller, font, p4)
	{
		mPosition          = pos;
		mIsSmallAdjustment = smlAdjust;
		mIsCustomMenu      = 1;
		mAnchorPoint.mMinX = glnWidth / 2;
		mAnchorPoint.mMinY = glnHeight / 2;
		mDiffuseColour.set(32, 128, 128, 192);
		mHighlightColour.set(32, 64, 32, 64);
		addKeyEvent(0x20, KBBTN_B, new Delegate1<Menu, Menu&>(this, &menuCloseMenu));

		char* str = new char[0x40];
		sprintf(str, "X = %.2f", mPosition->x);
		addOption(0, str, nullptr, true);
		addKeyEvent(1, KBBTN_NONE, new Delegate1<PositionMenu, Menu&>(this, &menuEnterX));
		addKeyEvent(4, KBBTN_Y, new Delegate1<PositionMenu, Menu&>(this, &menuDecrease));
		addKeyEvent(4, KBBTN_X, new Delegate1<PositionMenu, Menu&>(this, &menuIncrease));

		str = new char[0x40];
		sprintf(str, "Y = %.2f", mPosition->y);
		addOption(0, str, nullptr, true);
		addKeyEvent(1, KBBTN_NONE, new Delegate1<PositionMenu, Menu&>(this, &menuEnterY));
		addKeyEvent(4, KBBTN_Y, new Delegate1<PositionMenu, Menu&>(this, &menuDecrease));
		addKeyEvent(4, KBBTN_X, new Delegate1<PositionMenu, Menu&>(this, &menuIncrease));

		str = new char[0x40];
		sprintf(str, "Z = %.2f", mPosition->z);
		addOption(0, str, nullptr, true);
		addKeyEvent(1, KBBTN_NONE, new Delegate1<PositionMenu, Menu&>(this, &menuEnterZ));
		addKeyEvent(4, KBBTN_Y, new Delegate1<PositionMenu, Menu&>(this, &menuDecrease));
		addKeyEvent(4, KBBTN_X, new Delegate1<PositionMenu, Menu&>(this, &menuIncrease));
	}

	void updateComponent(Menu& menu, char* name, f32* valuePtr) { sprintf(menu.mCurrentItem->mName, "%s = %.2f", name, *valuePtr); }

	// _00     = VTBL
	// _00-_B4 = Menu
	Vector3f* mPosition;     // _B4
	bool mIsSmallAdjustment; // _B8
	f32* mComponentValue;    // _BC
	char* mComponentName;    // _C0
};

/**
 * @brief TODO
 */
struct ColourMenu : public Menu {
	void menuDecrease(Menu& menu)
	{
		if (*mComponentValue) {
			(*mComponentValue)--;
		}
		updateComponent(menu, mComponentName, mComponentValue);
	}
	void menuIncrease(Menu& menu)
	{
		if (*mComponentValue < 255) {
			(*mComponentValue)++;
		}
		updateComponent(menu, mComponentName, mComponentValue);
	}
	void menuEnterR(Menu& menu)
	{
		mComponentValue = &mColour->r;
		mComponentName  = "R";
		updateComponent(menu, mComponentName, mComponentValue);
	}
	void menuEnterG(Menu& menu)
	{
		mComponentValue = &mColour->g;
		mComponentName  = "G";
		updateComponent(menu, mComponentName, mComponentValue);
	}
	void menuEnterB(Menu& menu)
	{
		mComponentValue = &mColour->b;
		mComponentName  = "B";
		updateComponent(menu, mComponentName, mComponentValue);
	}
	void menuEnterA(Menu& menu)
	{
		mComponentValue = &mColour->a;
		mComponentName  = "A";
		updateComponent(menu, mComponentName, mComponentValue);
	}

	ColourMenu(Colour* color, Controller* controller, Font* font, bool p4)
	    : Menu(controller, font, p4)
	{
		mColour            = color;
		mIsCustomMenu      = 1;
		mAnchorPoint.mMinX = glnWidth / 2;
		mAnchorPoint.mMinY = glnHeight / 2;
		mDiffuseColour.set(32, 128, 128, 192);
		mHighlightColour.set(32, 64, 32, 64);
		addKeyEvent(0x20, KBBTN_B, new Delegate1<Menu, Menu&>(this, &menuCloseMenu));

		char* str = new char[0x40];
		sprintf(str, "R = %d", mColour->r);
		addOption(0, str, nullptr, true);
		addKeyEvent(1, KBBTN_NONE, new Delegate1<ColourMenu, Menu&>(this, &menuEnterR));
		addKeyEvent(4, KBBTN_Y, new Delegate1<ColourMenu, Menu&>(this, &menuDecrease));
		addKeyEvent(4, KBBTN_X, new Delegate1<ColourMenu, Menu&>(this, &menuIncrease));

		str = new char[0x40];
		sprintf(str, "G = %d", mColour->g);
		addOption(0, str, nullptr, true);
		addKeyEvent(1, KBBTN_NONE, new Delegate1<ColourMenu, Menu&>(this, &menuEnterG));
		addKeyEvent(4, KBBTN_Y, new Delegate1<ColourMenu, Menu&>(this, &menuDecrease));
		addKeyEvent(4, KBBTN_X, new Delegate1<ColourMenu, Menu&>(this, &menuIncrease));

		str = new char[0x40];
		sprintf(str, "B = %d", mColour->b);
		addOption(0, str, nullptr, true);
		addKeyEvent(1, KBBTN_NONE, new Delegate1<ColourMenu, Menu&>(this, &menuEnterB));
		addKeyEvent(4, KBBTN_Y, new Delegate1<ColourMenu, Menu&>(this, &menuDecrease));
		addKeyEvent(4, KBBTN_X, new Delegate1<ColourMenu, Menu&>(this, &menuIncrease));

		str = new char[0x40];
		sprintf(str, "A = %d", mColour->a);
		addOption(0, str, nullptr, true);
		addKeyEvent(1, KBBTN_NONE, new Delegate1<ColourMenu, Menu&>(this, &menuEnterA));
		addKeyEvent(4, KBBTN_Y, new Delegate1<ColourMenu, Menu&>(this, &menuDecrease));
		addKeyEvent(4, KBBTN_X, new Delegate1<ColourMenu, Menu&>(this, &menuIncrease));
	}

	void updateComponent(Menu& menu, char* name, u8* valuePtr) { sprintf(menu.mCurrentItem->mName, "%s = %d", name, *valuePtr); }

	// _00     = VTBL
	// _00-_B4 = Menu
	Colour* mColour;      // _B4
	u8* mComponentValue;  // _B8, this is a pointer to the component value (R, G, B, A) of mColour
	char* mComponentName; // _BC, this is the component name ("R", "G", "B", "A")
};

/**
 * @brief TODO
 */
struct FogMenu : public Menu {
	void menuDecrease(Menu& menu)
	{
		*mComponentValue -= 10.0f;
		updateComponent(menu, mComponentName, mComponentValue);
	}
	void menuIncrease(Menu& menu)
	{
		*mComponentValue += 10.0f;
		updateComponent(menu, mComponentName, mComponentValue);
	}
	void menuEnterNear(Menu& menu)
	{
		mComponentValue = mNear;
		mComponentName  = "Near";
		updateComponent(menu, mComponentName, mComponentValue);
	}
	void menuEnterFar(Menu& menu)
	{
		mComponentValue = mFar;
		mComponentName  = "Far";
		updateComponent(menu, mComponentName, mComponentValue);
	}

	FogMenu(Colour* color, f32* near, f32* far, Controller* controller, Font* font, bool p6)
	    : Menu(controller, font, p6)
	{
		mNear              = near;
		mFar               = far;
		mIsCustomMenu      = 1;
		mAnchorPoint.mMinX = glnWidth / 2;
		mAnchorPoint.mMinY = glnHeight / 2;
		mDiffuseColour.set(32, 128, 128, 192);
		mHighlightColour.set(32, 64, 32, 64);
		addKeyEvent(0x20, KBBTN_B, new Delegate1<Menu, Menu&>(this, &menuCloseMenu));

		addMenu(new ColourMenu(color, mController, gsys->mConsFont, true), 0, "fog colour");

		char* str = new char[0x40];
		sprintf(str, "Near = %.2f", *near);
		addOption(0, str, nullptr, true);
		addKeyEvent(1, KBBTN_NONE, new Delegate1<FogMenu, Menu&>(this, &menuEnterNear));
		addKeyEvent(4, KBBTN_Y, new Delegate1<FogMenu, Menu&>(this, &menuDecrease));
		addKeyEvent(4, KBBTN_X, new Delegate1<FogMenu, Menu&>(this, &menuIncrease));

		str = new char[0x40];
		sprintf(str, "Far = %.2f", *far);
		addOption(0, str, nullptr, true);
		addKeyEvent(1, KBBTN_NONE, new Delegate1<FogMenu, Menu&>(this, &menuEnterFar));
		addKeyEvent(4, KBBTN_Y, new Delegate1<FogMenu, Menu&>(this, &menuDecrease));
		addKeyEvent(4, KBBTN_X, new Delegate1<FogMenu, Menu&>(this, &menuIncrease));
	}

	void updateComponent(Menu& menu, char* name, f32* valuePtr) { sprintf(menu.mCurrentItem->mName, "%s = %.2f", name, *valuePtr); }

	// _00     = VTBL
	// _00-_B4 = Menu
	f32* mNear;           // _B4
	f32* mFar;            // _B8
	f32* mComponentValue; // _BC
	char* mComponentName; // _C0
};

static char* lightTypeNames[4] = { "OFF", "PARALLEL", "POINT", "SPOT" };
static int lightTypes[2]       = { 1, 3 };
static int lightConv[4]        = { 0, 0, 0, 1 };
static char* lightMoveNames[2] = { "global", "attach to navi" };

/**
 * @brief TODO
 */
struct LightMenu : public Menu {

	LightMenu(Light* light, int* attachType, Controller* controller, Font* font, bool p5)
	    : Menu(controller, font, p5)
	{
		mLight             = light;
		mSelectedLightType = 0;
		mLightAttachType   = attachType;
		mLight->mLightType = mLight->mLightType & 0xFFFFFF00 | lightTypes[mSelectedLightType];

		mAnchorPoint.mMinX = glnWidth / 2;
		mAnchorPoint.mMinY = glnHeight / 2;
		mDiffuseColour.set(32, 128, 128, 192);
		mHighlightColour.set(32, 64, 32, 64);
		addKeyEvent(0x20, KBBTN_B, new Delegate1<Menu, Menu&>(this, &menuCloseMenu));

		addOptions();
	}

	void menuDecrease(Menu& menu)
	{
		*mActiveValuePtr -= 1.0f;
		updateComponent(menu, mActiveValueName, mActiveValuePtr);
	}
	void menuIncrease(Menu& menu)
	{
		*mActiveValuePtr += 1.0f;
		updateComponent(menu, mActiveValueName, mActiveValuePtr);
	}
	void menuEnterNear(Menu& menu)
	{
		mActiveValuePtr  = mSpotFov;
		mActiveValueName = "Fov";
		updateComponent(menu, mActiveValueName, mActiveValuePtr);
	}
	void menuChangeType(Menu& menu)
	{
		mSelectedLightType = mSelectedLightType ^ 1;
		mLight->mLightType = mLight->mLightType & 0xFFFFFF00 | lightTypes[mSelectedLightType];
		resetOptions();
		addOptions();
		open(false);
	}
	void menuChangeMove(Menu& menu)
	{
		mLightAttachType[0] ^= 1;
		resetOptions();
		addOptions();
		open(false);
	}

	void addOptions()
	{
		mSelectedLightType = lightConv[(u8)mLight->mLightType];
		addOption(0, lightTypeNames[(u8)mLight->mLightType], new Delegate1<LightMenu, Menu&>(this, menuChangeType), true);
		addOption(0, nullptr, nullptr, true);
		if ((int)(u8)mLight->mLightType == 3) {
			mSpotFov = &mLight->mSpotAngle;
			addOption(0, lightMoveNames[mLightAttachType[0]], new Delegate1<LightMenu, Menu&>(this, menuChangeMove), true);

			char* str = new char[0x40];
			sprintf(str, "Fov = %.2f", *mSpotFov);
			addOption(0, str, nullptr, true);
			addKeyEvent(1, KBBTN_NONE, new Delegate1<LightMenu, Menu&>(this, menuEnterNear));
			addKeyEvent(4, KBBTN_Y, new Delegate1<LightMenu, Menu&>(this, menuDecrease));
			addKeyEvent(4, KBBTN_X, new Delegate1<LightMenu, Menu&>(this, menuIncrease));
		}

		if ((int)(u8)mLight->mLightType != 1) {
			addMenu(new PositionMenu(&mLight->mPosition, mController, gsys->mConsFont, true, false), 0, "position");
		}

		if ((int)(u8)mLight->mLightType == 3) {
			addMenu(new PositionMenu(&mLight->mDirection, mController, gsys->mConsFont, true, true), 0, "direction");
		}

		addMenu(new ColourMenu(&mLight->mDiffuseColour, mController, gsys->mConsFont, true), 0, "colour");
	}

	void updateComponent(Menu& menu, char* name, f32* valuePtr) { sprintf(menu.mCurrentItem->mName, "%s = %.2f", name, *valuePtr); }

	// _00     = VTBL
	// _00-_B4 = Menu
	int mSelectedLightType; //_B4, basically, is this a SPOT or a POINT light?
	int* mLightAttachType;  //_B8
	Light* mLight;          // _BC
	f32* mSpotFov;          // _C0
	f32* mActiveValuePtr;   // _C4
	char* mActiveValueName; // _C8
};

struct DaySetMenu : public Menu {
	DaySetMenu(TimeSetting* time, Controller* control, Font* font, bool flag)
	    : Menu(control, font, flag)
	{
		mTimeSettings      = time;
		mAnchorPoint.mMinX = glnWidth / 2;
		mAnchorPoint.mMinY = glnHeight / 2 + 60;
		mDiffuseColour.set(32, 128, 32, 192);
		mHighlightColour.set(32, 64, 32, 64);
		addKeyEvent(0x20, KBBTN_B, new Delegate1<Menu, Menu&>(this, &menuCloseMenu));
		addMenu(new ColourMenu(&mTimeSettings->mAmbientColour, mController, gsys->mConsFont, true), 0, "ambient colour");
		addMenu(
		    new FogMenu(&mTimeSettings->mFogColour, &mTimeSettings->mFogNear, &mTimeSettings->mFogFar, mController, gsys->mConsFont, true),
		    0, "fog");
		addOption(0, nullptr, nullptr, true);
		addMenu(new LightMenu(&mTimeSettings->mDayPhaseLights[0], &mTimeSettings->mAttachType[0], mController, gsys->mConsFont, true), 0,
		        "main light");
		addMenu(new LightMenu(&mTimeSettings->mDayPhaseLights[1], &mTimeSettings->mAttachType[1], mController, gsys->mConsFont, true), 0,
		        "sub light");
		addMenu(new LightMenu(&mTimeSettings->mDayPhaseLights[2], &mTimeSettings->mAttachType[2], mController, gsys->mConsFont, true), 0,
		        "+1 light");
		addMenu(new LightMenu(&mTimeSettings->mDayPhaseLights[3], &mTimeSettings->mAttachType[3], mController, gsys->mConsFont, true), 0,
		        "+2 light");
		addMenu(new LightMenu(&mTimeSettings->mDayPhaseLights[4], &mTimeSettings->mAttachType[4], mController, gsys->mConsFont, true), 0,
		        "+3 light");
		addMenu(new LightMenu(&mTimeSettings->mDayPhaseLights[5], &mTimeSettings->mAttachType[5], mController, gsys->mConsFont, true), 0,
		        "+4 light");
		addMenu(new LightMenu(&mTimeSettings->mDayPhaseLights[6], &mTimeSettings->mAttachType[6], mController, gsys->mConsFont, true), 0,
		        "+5 light");
	}

	// _00     = VTBL
	// _00-_B4 = Menu
	TimeSetting* mTimeSettings; // _B4
};

/*
 * --INFO--
 * Address:	........
 * Size:	000034
 */
void DayMgr::updateComponent(Menu& menu, char* name, int* valuePtr)
{
	sprintf(menu.mCurrentItem->mName, "%s = %d", name, *valuePtr);
}

/*
 * --INFO--
 * Address:	8006B3FC
 * Size:	00005C
 */
void DayMgr::menuBIncrease(Menu& menu)
{
	if (mMapMgr->mBlur < 255) {
		mMapMgr->mBlur++;
	}
	updateComponent(menu, "Blur", &mMapMgr->mBlur);
}

/*
 * --INFO--
 * Address:	8006B458
 * Size:	00005C
 */
void DayMgr::menuBDecrease(Menu& menu)
{
	if (mMapMgr->mBlur > 0) {
		mMapMgr->mBlur--;
	}
	updateComponent(menu, "Blur", &mMapMgr->mBlur);
}

/*
 * --INFO--
 * Address:	8006B4B4
 * Size:	001B80
 */
DayMgr::DayMgr(MapMgr* map, Controller* control)
{
	mMapMgr       = map;
	mLightCount   = 2;
	mMaxLights    = 7;
	mTimeSettings = new TimeSetting[5];

	mMenu                     = new Menu(control, gsys->mConsFont, false);
	mMenu->mIsCustomMenu      = 1;
	mMenu->mAnchorPoint.mMinX = glnWidth / 2;
