#include "MapMgr.h"
#include "AIPerf.h"
#include "Creature.h"
#include "CreatureCollPart.h"
#include "CreatureProp.h"
#include "DayMgr.h"
#include "DebugLog.h"
#include "DynColl.h"
#include "DynObject.h"
#include "EffectMgr.h"
#include "FlowController.h"
#include "Font.h"
#include "Graphics.h"
#include "MemStat.h"
#include "MoviePlayer.h"
#include "gameflow.h"
#include "sysNew.h"
#include "timers.h"

/*
 * --INFO--
 * Address:	........
 * Size:	00009C
 */
DEFINE_ERROR(__LINE__) // Never used in the DLL

/*
 * --INFO--
 * Address:	........
 * Size:	0000F0
 */
DEFINE_PRINT("mapMgr")

/**
 * @brief Fabricated name. Some struct has to exist here, but I don't think it's exposed anywhere.
 */
struct SoftLightLight {
	u32 mLastUpdateTick;       // _00
	SoftLightLight* mNext;     // _04
	u8* mColorChannels;        // _08
	s16 mAccumulatedIntensity; // _0C
};

BoundBox collExtents;
MapMgr* mapMgr;
static f32 Kda;
static u32 numRepeats; // type unsure
static u32 numUpdated; // type unsure
static SoftLightLight* vlink;

/**
 * @brief TODO
 */
struct SoftLight {
	void addLight(u32 p1, LShortColour*, Shape*)
	{
		if (mSublightList) {
			for (int i = 0; i < mLightListSize; i++) {
				if (mSublightList[i]->mLastUpdateTick != p1) {
					mSublightList[i]->mNext           = vlink;
					vlink                             = mSublightList[i];
					mSublightList[i]->mLastUpdateTick = p1;
				}
				mSublightList[i]->mAccumulatedIntensity += (mIntensityScales[i] * mEffectiveColour.r) >> 8;
			}
		}
	}
	void subLight(LShortColour*)
	{
		if (mSublightList) {
			for (int i = 0; i < mLightListSize; i++) {
				mSublightList[i]->mAccumulatedIntensity -= (mIntensityScales[i] * mEffectiveColour.r) >> 8;
			}
		}

		FORCE_DONT_INLINE;
	}

	Vector3f mPosition;             // _00
	Colour mEffectiveColour;        // _0C
	Colour mBaseColour;             // _10
	f32 mInteractionRadius;         // _14
	f32 mTargetPhaseAngle;          // _18
	f32 mCurrentPhaseAngle;         // _1C
	int mGroupId;                   // _20
	int mIsAnimFast;                // _24
	int mLightListSize;             // _28
	u8 _2C;                         // _2C
	SoftLightLight** mSublightList; // _30
	s16* mIntensityScales;          // _34
};

/**
 * @brief TODO
 */
struct MapLightMgr {

	void updateLights()
	{
		mCurrentUpdateTick++;
		numUpdated = 0;
		numRepeats = 0;
		vlink      = nullptr;

		for (int i = 0; i < mLightCount; i++) {
			sinf(mLights[i]->mCurrentPhaseAngle);

			bool check = false;
			if (mLights[i]->mCurrentPhaseAngle != mLights[i]->mTargetPhaseAngle) {
				f32 a = (mLights[i]->mIsAnimFast) ? 2.0f : 0.5f;
				mLights[i]->mCurrentPhaseAngle
				    += gsys->getFrameTime() * a * (mLights[i]->mTargetPhaseAngle - mLights[i]->mCurrentPhaseAngle);
				check = true;
			}

			if (check) {
				if (!mLights[i]->_2C) {
					mLights[i]->subLight(mAmbientColor);
				}
				mLights[i]->_2C = 0;
				f32 a           = sinf(mLights[i]->mCurrentPhaseAngle);
				if (a > 0.95f) {
					mLights[i]->mCurrentPhaseAngle = mLights[i]->mTargetPhaseAngle;
				}

				mLights[i]->mEffectiveColour.set(mLights[i]->mBaseColour.r * a, mLights[i]->mBaseColour.g * a,
				                                 mLights[i]->mBaseColour.b * a, 255);
				mLights[i]->addLight(mCurrentUpdateTick, mAmbientColor, mDefaultShape);
			}
		}

		if (vlink) {
			for (SoftLightLight* c = vlink; c; c = c->mNext) {
				u8 a                 = (c->mAccumulatedIntensity < 255) ? (u8)c->mAccumulatedIntensity : 255;
				c->mColorChannels[0] = a;
				c->mColorChannels[1] = a;
				c->mColorChannels[2] = a;
				c->mColorChannels[3] = a;
			}
		}
	}

	void touchLights(immut Vector3f& pos)
	{
		for (int i = 0; i < mLightCount; i++) {
			if (mLights[i]->mTargetPhaseAngle != HALF_PI) {
				f32 a = (mLights[i]->mIsAnimFast) ? mLights[i]->mInteractionRadius * 0.5f : mLights[i]->mInteractionRadius * 1.5f;
				if (mLights[i]->mPosition.distance(pos) < a) {
					mLights[i]->mTargetPhaseAngle = HALF_PI;
				}

				if (mLights[i]->mIsAnimFast) {
					for (int j = 0; j < mLightCount; j++) {
						if (i != j && mLights[j]->mGroupId == mLights[i]->mGroupId && mLights[j]->mCurrentPhaseAngle > 0.4f) {
							f32 d = mLights[i]->mPosition.distance(mLights[j]->mPosition);
							if (d < mLights[i]->mInteractionRadius) {
								mLights[i]->mTargetPhaseAngle = HALF_PI;
							}
						}
					}
				}
			}
		}
	}

	Shape* mDefaultShape;        // _00
	SoftLight** mLights;         // _04
	u8 padding[0x4];             // _08, unknown
	int mLightCount;             // _0C
	LShortColour* mAmbientColor; // _10
	u32 mCurrentUpdateTick;      // _14
};

/*
 * --INFO--
 * Address:	800617C0
 * Size:	000268
 */
void DynCollShape::createDupCollData()
{
	mVertexList = new Vector3f[mShape->mVertexCount];
	memcpy(mVertexList, mShape->mVertexList, mShape->mVertexCount * sizeof(Vector3f));

	mCollTriList = new CollTriInfo[mShape->mTriCount];
	memcpy(mCollTriList, mShape->mTriList, mShape->mTriCount * sizeof(CollTriInfo));

	mColliderList = nullptr;
	mVisibleList  = new bool[mShape->mJointCount];
	for (int i = 0; i < mShape->mJointCount; i++) {
		mVisibleList[i] = mShape->mJointList[i].mFlags != 0;
	}

	if (mShape->mBaseRoomCount <= 0) {
		return;
	}
	mColliderCount = mShape->mBaseRoomCount;
	mColliderList  = new CollGroup*[mColliderCount];
	for (int i = 0; i < mShape->mBaseRoomCount; i++) {
		int tris = 0;
		for (int j = 0; j < mShape->mTriCount; j++) {
			if (i == mCollTriList[j].mCollRoomId) {
				tris++;
			}
		}

		mColliderList[i]                = new CollGroup;
