#include "DynColl.h"
#include "DynObject.h"
#include "MapMgr.h"
#include "Creature.h"
#include "DebugLog.h"
#include "FlowController.h"
#include "Font.h"
#include "gameflow.h"
#include "Graphics.h"
#include "MoviePlayer.h"
#include "timers.h"
#include "CreatureProp.h"
#include "EffectMgr.h"
#include "AIPerf.h"
#include "MemStat.h"
#include "DayMgr.h"
#include "CreatureCollPart.h"
#include "sysNew.h"

/*
 * --INFO--
 * Address:	........
 * Size:	00009C
 */
DEFINE_ERROR()

/*
 * --INFO--
 * Address:	........
 * Size:	0000F0
 */
DEFINE_PRINT(nullptr)

/**
 * @brief Fabricated name. Some struct has to exist here, but I don't think it's exposed anywhere.
 */
struct SoftLightLight {
	u32 _00;             // _00
	SoftLightLight* _04; // _04
	u8* _08;             // _08
	s16 _0C;             // _0C
};

BoundBox collExtents;
MapMgr* mapMgr;
static f32 Kda;
static u32 numRepeats; // type unsure
static u32 numUpdated; // type unsure
static SoftLightLight* vlink;

/**
 * @brief TODO
 */
struct SoftLight {
	void addLight(u32 p1, LShortColour*, Shape*)
	{
		if (_30) {
			for (int i = 0; i < _28; i++) {
				if (_30[i]->_00 != p1) {
					_30[i]->_04 = vlink;
					vlink       = _30[i];
					_30[i]->_00 = p1;
				}
				_30[i]->_0C += (_34[i] * _0C.r) >> 8;
			}
		}
	}
	void subLight(LShortColour*)
	{
		if (_30) {
			for (int i = 0; i < _28; i++) {
				_30[i]->_0C -= (_34[i] * _0C.r) >> 8;
			}
		}
		FORCE_DONT_INLINE;
	}

	Vector3f _00;         // _00
	Colour _0C;           // _0C
	Colour _10;           // _10
	f32 _14;              // _14
	f32 _18;              // _18
	f32 _1C;              // _1C
	int _20;              // _20
	int _24;              // _24
	int _28;              // _28
	u8 _2C;               // _2C
	SoftLightLight** _30; // _30
	s16* _34;             // _34
};

/**
 * @brief TODO
 */
struct MapLightMgr {

	void updateLights()
	{
		_14++;
		numUpdated = 0;
		numRepeats = 0;
		vlink      = nullptr;

		for (int i = 0; i < mLightCount; i++) {
			sinf(mLights[i]->_1C);

			bool check = false;
			if (mLights[i]->_1C != mLights[i]->_18) {
				f32 a = (mLights[i]->_24) ? 2.0f : 0.5f;
				mLights[i]->_1C += gsys->getFrameTime() * a * (mLights[i]->_18 - mLights[i]->_1C);
				check = true;
			}

			if (check) {
				if (!mLights[i]->_2C) {
					mLights[i]->subLight(_10);
				}
				mLights[i]->_2C = 0;
				f32 a           = sinf(mLights[i]->_1C);
				if (a > 0.95f) {
					mLights[i]->_1C = mLights[i]->_18;
				}

				mLights[i]->_0C.set(mLights[i]->_10.r * a, mLights[i]->_10.g * a, mLights[i]->_10.b * a, 255);
				mLights[i]->addLight(_14, _10, _00);
			}
		}

		if (vlink) {
			for (SoftLightLight* c = vlink; c; c = c->_04) {
				u8 a      = (c->_0C < 255) ? (u8)c->_0C : 255;
				c->_08[0] = a;
				c->_08[1] = a;
				c->_08[2] = a;
				c->_08[3] = a;
			}
		}
	}

	void touchLights(Vector3f& pos)
	{
		for (int i = 0; i < mLightCount; i++) {
			if (mLights[i]->_18 != HALF_PI) {
				f32 a = (mLights[i]->_24) ? mLights[i]->_14 * 0.5f : mLights[i]->_14 * 1.5f;
				if (mLights[i]->_00.distance(pos) < a) {
					mLights[i]->_18 = HALF_PI;
				}

				if (mLights[i]->_24) {
					for (int j = 0; j < mLightCount; j++) {
						if (i != j && mLights[j]->_20 == mLights[i]->_20 && mLights[j]->_1C > 0.4f) {
							f32 d = mLights[i]->_00.distance(mLights[j]->_00);
							if (d < mLights[i]->_14) {
								mLights[i]->_18 = HALF_PI;
							}
						}
					}
				}
			}
		}
	}

	Shape* _00;          // _00
	SoftLight** mLights; // _04
	u8 _08[0x4];         // _08, unknown
	int mLightCount;     // _0C
	LShortColour* _10;   // _10
	u32 _14;             // _14
};

/*
 * --INFO--
 * Address:	800617C0
 * Size:	000268
 */
void DynCollShape::createDupCollData()
{
	mVertexList = new Vector3f[mShape->mVertexCount];
	memcpy(mVertexList, mShape->mVertexList, mShape->mVertexCount * sizeof(Vector3f));

	mCollTriList = new CollTriInfo[mShape->mTriCount];
	memcpy(mCollTriList, mShape->mTriList, mShape->mTriCount * sizeof(CollTriInfo));

	mColliderList = nullptr;
	mVisibleList  = new bool[mShape->mJointCount];
	for (int i = 0; i < mShape->mJointCount; i++) {
		mVisibleList[i] = mShape->mJointList[i].mFlags != 0;
	}

	if (mShape->mBaseRoomCount <= 0) {
		return;
	}
	mColliderCount = mShape->mBaseRoomCount;
	mColliderList  = new CollGroup*[mColliderCount];
	for (int i = 0; i < mShape->mBaseRoomCount; i++) {
		int tris = 0;
		for (int j = 0; j < mShape->mTriCount; j++) {
			if (i == mCollTriList[j]._10) {
				tris++;
			}
		}

		mColliderList[i]                = new CollGroup;
