#include "MapSelect.h"
#include "Delegate.h"
#include "sysNew.h"
#include "Graphics.h"
#include "jaudio/PikiScene.h"
#include "Menu.h"
#include "Demo.h"
#include "gameflow.h"
#include "FlowController.h"
#include "DebugLog.h"

zen::DrawWorldMap* mapWindow;
zen::DrawCMcourseSelect* selectWindow;

/*
 * --INFO--
 * Address:	........
 * Size:	00009C
 */
DEFINE_ERROR()

/*
 * --INFO--
 * Address:	........
 * Size:	0000F4
 */
DEFINE_PRINT("MapSelect")

/**
 * @brief TODO
 */
struct MapSelectSetupSection : public Node {
	MapSelectSetupSection()
	{
		setName("MapSelect section");
		_30   = new Controller;
		_20   = 0;
		mFont = new Font;
		mFont->setTexture(gsys->loadTexture("consFont.bti", true), 16, 8);
		mBigFont = new Font;
		mBigFont->setTexture(gsys->loadTexture("bigFont.bti", true), 21, 42);
		makeMapsMenu();
		mMenu->addOption(0, nullptr, nullptr, true);
		Delegate1<MapSelectSetupSection, Menu&>* delegate;
		if (!gameflow.mIsChallengeMode) {
			delegate = new Delegate1<MapSelectSetupSection, Menu&>(this, openAllMaps);
		} else {
			delegate = new Delegate1<MapSelectSetupSection, Menu&>(this, openAllChMaps);
		}
		mMenu->addOption(0, "Open All Maps", delegate, true);
		_2C = nullptr;

		mapWindow    = nullptr;
		selectWindow = 0;
		if (!gameflow.mIsChallengeMode) {
			mapWindow = new zen::DrawWorldMap;

			bool old           = gsys->mTogglePrint != 0;
			gsys->mTogglePrint = true;
			// PRINT("opening map window with %d : %d\n");
			gsys->mTogglePrint = old;

			mapWindow->start(zen::DrawWorldMap::startModeFlag(gameflow.mLastUnlockedStageId == -1 ? 0 : gameflow.mLastUnlockedStageId),
			                 zen::DrawWorldMap::startPlaceFlag(gameflow._1CC == -1 ? 0 : gameflow._1CC));
		} else {
			gameflow.mWorldClock.mCurrentDay = 1;
			selectWindow                     = new zen::DrawCMcourseSelect;
			selectWindow->start();
		}
		gsys->setFade(1.0f, 3.0f);
		_24 = 0xb0000;
	}

	virtual void update();        // _10 (weak)
	virtual void draw(Graphics&); // _14 (weak)

	void openAllChMaps(Menu&);
	void openAllMaps(Menu&);
	void menuSelectOption(Menu&);
	void makeMapsMenu();

	// _00     = VTBL
	// _00-_20 = Node
	u32 _20;         // _20
	u32 _24;         // _24
	Menu* mMenu;     // _28
	Menu* _2C;       // _2C
	Controller* _30; // _30
	Font* mFont;     // _34
	Font* mBigFont;  // _38
	Camera mCamera;  // _3C
};

/*
 * --INFO--
 * Address:	8005570C
 * Size:	000368
 */
void MapSelectSetupSection::openAllChMaps(Menu& parent)
{
	for (int i = 0; i < STAGE_COUNT; i++) {
		gameflow.mGamePrefs.openStage(i);
	}

	mMenu            = new Menu(_30, mFont, false);
	mMenu->_48.mMinX = glnWidth / 2;
	mMenu->_48.mMinY = glnHeight / 2 + 30;
	mMenu->addKeyEvent(0x10, 0x1001000, new Delegate1<MapSelectSetupSection, Menu&>(this, menuSelectOption));
	mMenu->addKeyEvent(0x20, 0x2000, new Delegate1<Menu, Menu&>(mMenu, Menu::menuCloseMenu));

	for (StageInfo* inf = (StageInfo*)flowCont.mRootInfo.mChild; inf; inf = (StageInfo*)inf->mNext) {
		if (gameflow.mIsChallengeMode) {
			PRINT("checking map in challenge mode!\n");
			bool valid = gameflow.mGamePrefs.isStageOpen(inf->mChalStageID);
			if (inf->mIsVisible && valid) {
				mMenu->addOption((int)inf, StdSystem::stringDup(inf->mStageName), nullptr, true);
			}
		} else {
			bool valid = gameflow.mPlayState.isStageOpen(inf->mStageID);
