#include "NewPikiGame.h"

#include "Controller.h"
#include "DayMgr.h"
#include "DebugLog.h"
#include "Font.h"
#include "GameCoreSection.h"
#include "GameStat.h"
#include "Graphics.h"
#include "Interface.h"
#include "KIO.h"
#include "LifeGauge.h"
#include "MapMgr.h"
#include "MemStat.h"
#include "Menu.h"
#include "ModeState.h"
#include "MoviePlayer.h"
#include "NaviMgr.h"
#include "Pcam/Camera.h"
#include "Pcam/CameraManager.h"
#include "Pellet.h"
#include "PlayerState.h"
#include "Section.h"
#include "SoundMgr.h"
#include "gameflow.h"
#include "jaudio/piki_scene.h"
#include "jaudio/pikidemo.h"
#include "sysNew.h"
#include "timers.h"
#include "zen/DrawCM.h"
#include "zen/DrawCountDown.h"
#include "zen/DrawFinalResult.h"
#include "zen/DrawGameInfo.h"
#include "zen/DrawGameOver.h"
#include "zen/ogFileChkSel.h"
#include "zen/ogMemChk.h"
#include "zen/ogMenu.h"
#include "zen/ogPause.h"
#include "zen/ogResult.h"
#include "zen/ogTotalScore.h"
#include "zen/ogTutorial.h"

struct NewPikiGameSetupSection;

/// New piki game section instance
static NewPikiGameSetupSection* npgss;

/// Core gameplay section instance
static GameCoreSection* gamecore;

/// Current index of the Movie Player debug menu. (See `CinDemoIDs` enum)
static int movieIndex;

/// UI windows for various game states
static zen::DrawCMresult* challengeWindow;
static zen::DrawGameOver* gameoverWindow;
static zen::DrawCountDown* countWindow;
static zen::ogScrPauseMgr* pauseWindow;
static zen::ogScrResultMgr* resultWindow;
static zen::DrawFinalResult* totalWindow;
static zen::ogScrFileChkSelMgr* memcardWindow;

/// Whether menu overlay is active
static bool menuOn;

/// Whether game info HUD should be displayed
static bool gameInfoOn;

/// Whether game info HUD is currently visible
static bool gameInfoIn;

/// UI windows for the main menu & tutorial
static zen::ogScrMenuMgr* menuWindow;
static zen::ogScrTutorialMgr* tutorialWindow;

/// Whether or not the demo has sound enabled
static bool hasDemoSound;

/// Whether or not to suppress HUD frame display
static bool dontShowFrame;

/// Day end result documents table
static int resultTable[16];

/**
 * @todo: Documentation
 * @note UNUSED Size: 00009C
 */
DEFINE_ERROR(61)

/**
 * @todo: Documentation
 * @note UNUSED Size: 0000F4
 */
DEFINE_PRINT("newPikiGame");

/**
 * @brief TODO
 */
struct GameMovieInterface : public GameInterface {
	GameMovieInterface(NewPikiGameSetupSection* section)
	{
		mMessageLimit = 32;
		mMessageCount = 0;
		mSection      = section;
	}

	/**
	 * @brief TODO
	 */
	struct SimpleMessage {
		int mMessageId; // _00
		int mData;      // _04
	};

	/**
	 * @brief TODO
	 */
	struct ComplexMessage {
		ComplexMessage() { }

		int mMovieIdx;      // _00
		int _UNUSED04;      // _04
		Creature* mTarget;  // _08
		Vector3f mPosition; // _0C
		Vector3f mRotation; // _18
		int mFlags;         // _24
		bool mIsPlaying;    // _28
	};

	virtual void message(int msgId, int data) // _08
	{
		if (mMessageCount >= mMessageLimit) {
			return;
		}

		mMesg[mMessageCount].mMessageId = msgId;
		mMesg[mMessageCount].mData      = data;

		mMessageCount++;
	}
	virtual void movie(int id, int a1, Creature* obj, immut Vector3f* pos, immut Vector3f* dir, u32 flags, bool a2) // _0C
	{
		if (mComplexMesgCount >= mMessageLimit) {
			return;
		}
		mCompMesg[mComplexMesgCount].mMovieIdx = id;
		mCompMesg[mComplexMesgCount]._UNUSED04 = a1;
		mCompMesg[mComplexMesgCount].mTarget   = obj;
		if (!pos) {
			mCompMesg[mComplexMesgCount].mPosition.set(0.0f, 0.0f, 0.0f);
		} else {
			mCompMesg[mComplexMesgCount].mPosition = *pos;
		}
		if (!dir) {
			mCompMesg[mComplexMesgCount].mRotation.set(0.0f, 0.0f, 0.0f);
		} else {
			mCompMesg[mComplexMesgCount].mRotation = *dir;
		}
		mCompMesg[mComplexMesgCount].mFlags     = flags;
		mCompMesg[mComplexMesgCount].mIsPlaying = a2;

		mComplexMesgCount++;
	}
	virtual void parseMessages();        // _10
	virtual void parse(SimpleMessage&);  // _18
	virtual void parse(ComplexMessage&); // _1C

	// _00 = VTBL
	NewPikiGameSetupSection* mSection; // _04
	int mMessageLimit;                 // _08
	SimpleMessage mMesg[32];           // _0C
	int mMessageCount;                 // _10C
	ComplexMessage mCompMesg[32];      // _110
	int mComplexMesgCount;             // _690
};

/**
 * @brief State for quitting the game and returning to menu.
 */
struct QuittingGameModeState : public ModeState {
	QuittingGameModeState(BaseGameSection* c)
	    : ModeState(c)
	{
	}

	virtual ModeState* update(u32& result) // _08
	{
		PRINT("quitter updating!\n");
		result = UPDATE_NONE;
		return this;
	}

	virtual void postUpdate() // _10
	{
		// Trigger soft reset when system operations are complete
		if (!gsys->mSysOpPending) {
			PRINT("sending softreset!\n");
			gamecore->exitStage();
			gameflow.mNextOnePlayerSectionID       = mSection->mPendingOnePlayerSectionID;
			gameflow.mNextOnePlayerSectionOnDayEnd = ONEPLAYER_MapSelect;
			Jac_SceneExit(SCENE_Unk13, 0);
			gsys->softReset();
		}
	}

	///< 00     = VTBL
	///< 00-_04 = ModeState
};

/**
 * @brief State for displaying either of the game over states
 */
struct MessageModeState : public ModeState {
	MessageModeState(BaseGameSection* c, bool flag)
	    : ModeState(c)
	{
