#include "zen/DrawWorldMap.h"
#include "zen/EffectMgr2D.h"
#include "zen/DrawCommon.h"
#include "P2D/Pane.h"
#include "P2D/TextBox.h"
#include "DebugLog.h"
#include "sysNew.h"

#define MAX_PARTS_PRACTICE  (2)
#define MAX_PARTS_FOREST    (8)
#define MAX_PARTS_CAVE      (9)
#define MAX_PARTS_YAKUSHIMA (10)
#define MAX_PARTS_LAST      (1)

namespace {
zen::EffectMgr2D* WMeffMgr;

// idk what's going on with these. mapNoScr2Game has to spit out WorldMapName values, which have to equal StageID values
u8 mapNoScr2Game[5] = { WM_Yakushima, WM_Forest, WM_Practice, WM_Cave, WM_Last };
u8 mapNoGame2Scr[5] = { WMSCR_Practice, WMSCR_Forest, WMSCR_Cave, WMSCR_Yakushima, WMSCR_Last };
} // namespace

/*
 * --INFO--
 * Address:	........
 * Size:	00009C
 */
DEFINE_ERROR()

/*
 * --INFO--
 * Address:	........
 * Size:	0000F4
 */
DEFINE_PRINT("drawWorldMap")

namespace zen {
/**
 * @brief TODO
 *
 * @note Size: 0x28.
 */
struct WorldMapWipe {
	WorldMapWipe() { mWipePane = nullptr; }

	// weak
	void init(P2DScreen* wipeScreen, u32 tag)
	{
		P2DPane* pane = wipeScreen->search(tag, true);
		if (pane->getTypeID() == PANETYPE_Picture) {
			mWipePane = (P2DPicture*)pane;
			_00.set(mWipePane->getPosH() + (mWipePane->getWidth() >> 1), mWipePane->getPosV() + (mWipePane->getHeight() >> 1), 0.0f);
			move(mWipePane->getPosH(), mWipePane->getPosV());

		} else {
			// these are load bearing, take these out and this inlines :')
			PRINT("not picture pane.\n");
			ERROR("not picture pane.\n");
		}
	}

	void move(int x, int y)
	{
		x -= (mWipePane->getWidth() >> 1);
		y -= (mWipePane->getHeight() >> 1);

		_0C.set(mWipePane->getPosH(), mWipePane->getPosV(), 0.0f);
		_18.set(x, y, 0.0f);
	}

	void set(int x, int y)
	{
		x -= (mWipePane->getWidth() >> 1);
		y -= (mWipePane->getHeight() >> 1);
		mWipePane->move(x, y);
		_0C.set(x, y, 0.0f);
		_18.set(x, y, 0.0f);
	}

	void moveDefaultPos() { move(zen::RoundOff(_00.x), zen::RoundOff(_00.y)); }
	void update(f32 t, u8 alpha)
	{
		f32 tComp = 1.0f - t;
		mWipePane->move(zen::RoundOff(_0C.x * tComp + _18.x * t), zen::RoundOff(_0C.y * tComp + _18.y * t));
		mWipePane->setAlpha(alpha);
	}

	void setDefault() { set(zen::RoundOff(_00.x), zen::RoundOff(_00.y)); }

	Vector3f _00;          // _00
	Vector3f _0C;          // _0C
	Vector3f _18;          // _18
	P2DPicture* mWipePane; // _24
};

/**
 * @brief TODO
 *
 * @note Size: 0xB0.
 */
struct WorldMapWipeMgr {
	WorldMapWipeMgr()
	{
		_04       = 0.0f;
		_08       = 1.0f;
		mIsActive = false;
	}

	void init(P2DScreen* wipeScreen)
	{
		mWipes[0].init(wipeScreen, 'wp00');
		mWipes[1].init(wipeScreen, 'wp01');
		mWipes[2].init(wipeScreen, 'wp02');
		mWipes[3].init(wipeScreen, 'wp03');
		init();
	}

	void init()
	{
		_04       = 0.0f;
		_08       = 0.8f;
		mIsActive = false;
	}

	void set(int x, int y)
	{
		for (int i = 0; i < 4; i++) {
			mWipes[i].set(x, y);
		}
		_00 = 0;
	}

	void open(f32 p1)
	{
		_04 = 0.0f;
		_08 = p1;
		for (int i = 0; i < 4; i++) {
			mWipes[i].moveDefaultPos();
		}
		_00       = 2;
		mIsActive = true;
	}

	bool isActive() { return mIsActive; }

	bool update()
	{
		mIsActive = false;
		int state = _00;
		switch (state) {
		case 0:
			break;
		case 1:
		case 2:
			_04 += gsys->getFrameTime();
			if (_04 > _08) {
				_04   = _08;
				state = 0;
			}
			f32 blendFactor;
			u8 alpha;
			if (_00 == 2) {
				f32 t       = (1.0f - cosf(_04 / _08 * PI)) * 0.5f;
				blendFactor = t;
				alpha       = zen::RoundOff(255.0f * (1.0f - t));
			} else {
				f32 t       = sinf(_04 / _08 * HALF_PI);
				blendFactor = t;
				alpha       = zen::RoundOff(255.0f * t);
			}

			for (int i = 0; i < 4; i++) {
				mWipes[i].update(blendFactor, alpha);
			}

			_00       = state;
			mIsActive = true;
			break;
		}

		return mIsActive;
	}

	void close(f32 p1, int p2, int p3)
	{
		_04 = 0.0f;
		_08 = p1;
		for (int i = 0; i < 4; i++) {
			mWipes[i].move(p2, p3);
		}
		_00       = 1;
		mIsActive = true;
	}

	void setDefault()
	{
		for (int i = 0; i < 4; i++) {
			mWipes[i].setDefault();
		}
		_00 = 0;
	}

	int _00;                // _00
	f32 _04;                // _04
	f32 _08;                // _08
	WorldMapWipe mWipes[4]; // _0C
	bool mIsActive;         // _AC
};

/**
 * @brief TODO
 *
 * @note Size: 0x3C.
 */
struct WorldMapCursorOnyon {
	WorldMapCursorOnyon()
	{
		mOnyonIcon = nullptr;
		_04.set(0.0f, 0.0f, 0.0f);
		_1C.set(0.0f, 0.0f, 0.0f);
		_34 = zen::Rand(scaleFrameMax);
		mBottomPos.set(0.0f, bottomLengthDefault, 0.0f);
	}

	// weak:
	void init()
	{
		if (mOnyonIcon) {
			mOnyonIcon->setOffset(mOnyonIcon->getWidth() >> 1, mOnyonIcon->getHeight() >> 2);
		} else {
			PRINT("Illegal init WorldMapCursorOnyon Class.\n");
			ERROR("Illegal initialize.");
		}

		_34 = zen::Rand(scaleFrameMax);

		_04.set(0.0f, 0.0f, 0.0f);
		_1C.set(0.0f, 0.0f, 0.0f);
		mBottomPos.set(0.0f, bottomLengthDefault, 0.0f);

		_38 = WMeffMgr->create(50, Vector3f(0.0f, 0.0f, 0.0f), nullptr, nullptr);
	}
	void update(Vector3f&);

	// DLL:
	void init(P2DScreen* iconScreen, u32 tag, bool hideIcon)
	{
		P2DPane* icon = iconScreen->search(tag, true);
		if (icon->getTypeID() == PANETYPE_Picture) {
			mOnyonIcon = (P2DPicture*)icon;
			if (hideIcon) {
				mOnyonIcon->hide();
			}
		}

		init();
	}
	void show()
	{
		mOnyonIcon->show();
		if (_38) {
			_38->startGen();
		}
	}
	void hide()
	{
		mOnyonIcon->hide();
		if (_38) {
			_38->stopGen();
		}
	}
	void move(f32 x, f32 y) { _10.set(x, y, 0.0f); }
	void set(f32 x, f32 y, f32 scale)
	{
		_04.set(x, y, 0.0f);
		_10.set(x, y, 0.0f);
		mBottomPos.set(x, y + bottomLengthDefault, 0.0f);
		mOnyonIcon->move(_04.x, _04.y);
		mOnyonIcon->setScale(Vector3f(scale, scale, 1.0f));
	}

	// DLL inlines:
	void updateBottomPos();

	static f32 scaleFrameMax;
	static f32 bottomLengthMin;
	static f32 bottomLengthMax;
	static f32 bottomLengthDefault;

	P2DPicture* mOnyonIcon; // _00
	Vector3f _04;           // _04
	Vector3f _10;           // _10
	Vector3f _1C;           // _1C
	Vector3f mBottomPos;    // _28
	f32 _34;                // _34
	particleGenerator* _38; // _38
};

/**
 * @brief TODO
 *
 * @note Size: 0x12C.
 */
struct WorldMapCursorMgr {

	/**
	 * @brief TODO
	 */
	enum ufoStatusFlag {
		UFO_Unk0 = 0,
		UFO_Unk1 = 1,
		UFO_Unk2 = 2,
	};

	WorldMapCursorMgr()
	{
		mRocketIcon = nullptr;
		for (int i = 0; i < 2; i++) {
			_110[i] = 0;
		}

		initParams();
	}

	// weak functions:
	void initParams()
	{
		setLandingFlag(false);
		_35 = 0;
		_38.set(0.0f, 0.0f, 0.0f);
		_00 = 0.0f;
		_0C.set(0.0f, 0.0f, 0.0f);
		_24.set(0.0f, 0.0f, 0.0f);
		mRocketPos.set(0.0f, 0.0f, 0.0f);
		_30 = 0.0f;
		mBlueOnyonPos.set(0.0f, 0.0f, 0.0f);
		mOnyonVelocity.set(0.0f, 0.0f, 0.0f);
		setUfoStatus(UFO_Unk0);
		_128 = 1.0f;
	}

	void setLandingFlag(bool doSet)
	{
		if (doSet) {
			_34 = 1;
			SeSystem::playSysSe(SYSSE_SELECT_DECIDE);

			if (_110[0]) {
				_110[0]->setInitVel(4.0f * _118);
			}
			if (_110[1]) {
				_110[1]->setInitVel(5.0f * _11C);
			}
		} else {
			_34 = 0;
			if (_110[0]) {
				_110[0]->setInitVel(_118);
			}
			if (_110[1]) {
				_110[1]->setInitVel(_11C);
			}
		}
	}
	void init()
	{
		int i;
		if (mRocketIcon) {
			mRocketPos.set(mRocketIcon->getPosH(), mRocketIcon->getPosV(), 0.0f);
			mRocketIcon->setOffset(mRocketIcon->getWidth() >> 1, mRocketIcon->getHeight() >> 1);
			mRocketIcon->setScale(1.0f);
		} else {
			PRINT("Illegal initilize.\n");
			ERROR("Illegal initilize.\n");
		}

		initParams();
		mCursorOnyons[Blue].init();
		mCursorOnyons[Red].init();
		mCursorOnyons[Yellow].init();

		for (i = 0; i < 2; i++) {
			if (_110[i]) {
				_110[0]->forceFinish(); // oops
			}
		}

		_110[0] = WMeffMgr->create(48, Vector3f(0.0f, 0.0f, 0.0f), nullptr, nullptr);
		_110[0]->invisible();
		_118 = _110[0]->getInitVel();
		_120 = _110[0]->getFreqFrm();

		_110[1] = WMeffMgr->create(49, Vector3f(0.0f, 0.0f, 0.0f), nullptr, nullptr);
		_110[1]->invisible();
		_11C = _110[1]->getInitVel();
		_124 = _110[0]->getFreqFrm(); // maybe typo?

		if (playerState) {
			for (i = 0; i < PikiColorCount; i++) {
				if (playerState->displayPikiCount(i)) {
					mCursorOnyons[i].show();
				} else {
					mCursorOnyons[i].hide();
				}
			}
		} else {
			mCursorOnyons[Blue].show();
			mCursorOnyons[Red].show();
			mCursorOnyons[Yellow].show();
		}
	}
	void moveOnyon()
	{
		Vector3f onyonPos[PikiColorCount];
		updateOnyonPos(&onyonPos[Blue], &onyonPos[Red], &onyonPos[Yellow]);
		mCursorOnyons[Blue].move(onyonPos[Blue].x, onyonPos[Blue].y);
		mCursorOnyons[Red].move(onyonPos[Red].x, onyonPos[Red].y);
		mCursorOnyons[Yellow].move(onyonPos[Yellow].x, onyonPos[Yellow].y);
	}
	void updateOnyonPos(Vector3f* bluePos, Vector3f* redPos, Vector3f* yellowPos)
	{
		Vector3f orbitCenter;
		Vector3f newBlueTargetPos;
		Vector3f orbitVec;

		f32 time        = 60.0f * gsys->getFrameTime();
		f32 rocketScale = mRocketIcon->getScale().x;
		orbitCenter.set(mRocketPos.x + ONYON_OFFSET_X, mRocketPos.y + ONYON_OFFSET_Y, mRocketPos.z + ONYON_OFFSET_Z);

		mBlueOnyonPos.add(Vector3f(mOnyonVelocity * time));
		orbitVec.set(mBlueOnyonPos - orbitCenter);
		f32 norm = orbitVec.length();
		if (norm < 0.000001f) {
			orbitVec.set(0.0f, 0.0f, 0.0f);
		} else {
			orbitVec.multiply(ONYON_POS_RADIUS * rocketScale / norm);
		}

		newBlueTargetPos.set(orbitCenter + orbitVec);
		mOnyonVelocity.add(Vector3f(newBlueTargetPos - mBlueOnyonPos));
		mBlueOnyonPos.set(newBlueTargetPos);

		// set blue onyon position (just calculated, reference for others)
		bluePos->set(mBlueOnyonPos.x, mBlueOnyonPos.y, 0.0f);

		// calculate red onyon position (120 degrees rotated from blue)
		f32 cosR = cosf(TAU / 3.0f);
		f32 sinR = sinf(TAU / 3.0f);
		redPos->set(orbitVec.x * cosR + orbitCenter.x - orbitVec.y * sinR, orbitVec.x * sinR + orbitCenter.y + orbitVec.y * cosR, 0.0f);

		// calculate yellow onyon position (240 degrees rotated from blue)
		f32 cosY = cosf(2.0f * TAU / 3.0f);
		f32 sinY = sinf(2.0f * TAU / 3.0f);
		yellowPos->set(orbitVec.x * cosY + orbitCenter.x - orbitVec.y * sinY, orbitVec.x * sinY + orbitCenter.y + orbitVec.y * cosY, 0.0f);
	}
	void stayUfo()
	{
		Vector3f vec1;
		f32 sec = 60.0f * gsys->getFrameTime();
		vec1.set(_0C.x - mRocketPos.x, _0C.y - mRocketPos.y, 0.0f);
		vec1.multiply(0.8f * gsys->getFrameTime());
		_24.add(vec1);
		_24.multiply(0.92f);
		f32 len = _24.length();
		if (len < 0.000001f) {
			_24.set(0.0f, 0.5f, 0.0f);
		} else {
			if (len > 1.0f) {
				_24.multiply(1.0f / len);
			}
			if (len < 0.5f) {
				_24.multiply(0.5f / len);
			}
		}

		mRocketPos.add(_24);

		mRocketIcon->move(zen::RoundOff(mRocketPos.x), zen::RoundOff(mRocketPos.y));
		_30 += calcAddAngle(mRocketIcon->getRotate(), 0.0f, 0.017453292f, sec);
		_30 *= 0.9999f;
		if (_30 > (5.0f * PI / 180.0f)) {
			_30 = (5.0f * PI / 180.0f);
		}
		if (_30 < -(5.0f * PI / 180.0f)) {
			_30 = -(5.0f * PI / 180.0f);
		}

		rotateUfo(zen::correctRad(_30 + mRocketIcon->getRotate()));

		u32 badCompiler;

		PRINT("fake", mRocketIcon ? "fake" : "fake");
		PRINT("fake", mRocketIcon ? "fake" : "fake");
		PRINT("fake", mRocketIcon ? "fake" : "fake");
	}

	bool moveUfo()
	{
		bool res = false;
		Vector3f vec1;
		f32 sec   = 60.0f * gsys->getFrameTime();
		f32 scale = mRocketIcon->getScale().x;
		f32 a     = 1.0f;

		vec1.set(_0C.x - mRocketPos.x, _0C.y - mRocketPos.y, 0.0f);
	}
	void forceMove();
	void effect();

	// DLL:
	void setUfoStatus(ufoStatusFlag status)
	{
		mUfoStatus = status;
		switch (mUfoStatus) {
		case UFO_Unk0:
			_30 = 0.0f;
			break;
		case UFO_Unk1:
			break;
		}
	}

	void init(P2DScreen* iconScreen)
	{
		P2DPane* rocket = iconScreen->search('ri', true);
		if (rocket->getTypeID() == PANETYPE_Picture) {
			mRocketIcon = (P2DPicture*)rocket;
		}

		mCursorOnyons[Blue].init(iconScreen, 'ci_b', false);
		mCursorOnyons[Red].init(iconScreen, 'ci_r', false);
		mCursorOnyons[Yellow].init(iconScreen, 'ci_y', false);
		init();
	}
	void updateOnyons()
	{
		moveOnyon();
		for (int i = 0; i < PikiColorCount; i++) {
			mCursorOnyons[i].update(mRocketIcon->getScale());
		}
	}
	void update()
	{
		switch (mUfoStatus) {
		case UFO_Unk0:
			stayUfo();
			break;

		case UFO_Unk1:
			if (moveUfo()) {
				if (_35) {
					forceMove();
				} else if (_34) {
					setUfoStatus(UFO_Unk2);
				} else {
					setUfoStatus(UFO_Unk0);
				}
			}
			break;
		case UFO_Unk2:
			break;
		}

		updateOnyons();
		effect();
	}

	ufoStatusFlag getStatusFlag() { return mUfoStatus; }

	bool isLanding() { return _34; }
	bool isMoveOK() { return !_35 && !_34; }

	f32 calcAddAngle(f32 p1, f32 p2, f32 p3, f32 p4)
	{
		f32 diff = p2 - p1;
		if (zen::Abs(diff) > p3) {
			f32 x = p3;
			if (zen::Abs(diff) < PI) {
				if (diff < 0.0f) {
					x *= -1.0f;
				}
			} else if (diff > 0.0f) {
				x *= -1.0f;
			}

			return x * p4;
		}

		return diff;
	}

	void rotateUfo(f32 angle) { mRocketIcon->rotateZ(mRocketIcon->getWidth() >> 1, mRocketIcon->getHeight() >> 1, angle); }

	void set(int x, int y, f32 scale)
	{
		mRocketPos.set(x, y, 0.0f);
		_0C.set(x, y, 0.0f);
		mRocketIcon->move(x, y);
		mRocketIcon->setScale(Vector3f(scale, scale, 1.0f));
		setOnyonPos(scale);
	}
	void setOnyonPos(f32 scale)
	{
		Vector3f onyonPos[PikiColorCount];
		updateOnyonPos(&onyonPos[Blue], &onyonPos[Red], &onyonPos[Yellow]);
		mCursorOnyons[Blue].set(onyonPos[Blue].x, onyonPos[Blue].y, scale);
		mCursorOnyons[Red].set(onyonPos[Red].x, onyonPos[Red].y, scale);
		mCursorOnyons[Yellow].set(onyonPos[Yellow].x, onyonPos[Yellow].y, scale);
	}
	void move(int x, int y, bool p3)
	{
		bool check = false;
		if (_35) {
			return;
		}

		if (p3) {
			switch (mUfoStatus) {
			case UFO_Unk0:
				_00   = 0.0f;
				check = true;
				setLandingFlag(true);
				break;
			case UFO_Unk1:
				if (!_34) {
					_35 = true;
					_38.set(x, y, 0.0f);
				}
				break;
			}
		} else if (!_34) {
			check = true;
		}

		if (check) {
			if (!_34 && !_35) {
				SeSystem::playSysSe(SYSSE_SELECT_MOVE);
			}
			setUfoStatus(UFO_Unk1);
			_0C.set(x, y, 0.0f);
		}
	}

	// DLL inlines to do:
	void moveCancel(int, int);

	static const f32 ONYON_POS_RADIUS;
	static const f32 ONYON_OFFSET_X;
	static const f32 ONYON_OFFSET_Y;
	static const f32 ONYON_OFFSET_Z;

	f32 _00;                                           // _00
	ufoStatusFlag mUfoStatus;                          // _04
	P2DPicture* mRocketIcon;                           // _08
	Vector3f _0C;                                      // _0C
	Vector3f mRocketPos;                               // _18
	Vector3f _24;                                      // _24
	f32 _30;                                           // _30
	bool _34;                                          // _34
	bool _35;                                          // _35
	Vector3f _38;                                      // _38
	WorldMapCursorOnyon mCursorOnyons[PikiColorCount]; // _44, indexed by PikiColor
	Vector3f mBlueOnyonPos;                            // _F8
	Vector3f mOnyonVelocity;                           // _104
	zen::particleGenerator* _110[2];                   // _110
	f32 _118;                                          // _118
	f32 _11C;                                          // _11C
	f32 _120;                                          // _120
	f32 _124;                                          // _124
	f32 _128;                                          // _128
};

/**
 * @brief TODO
 */
struct WorldMapPartsInfoMgr {
	WorldMapPartsInfoMgr()
	{
		mMaxPartCount   = 0;
		mFadedStarIcons = nullptr;
	}

	void setDisplayParts(int max, int curr)
	{
		for (int i = 0; i < mMaxPartCount; i++) {
			if (i < max) {
				if (i < curr) {
					mGlowingStarIcons[i]->show();
					mFadedStarIcons[i]->hide();
				} else {
					mGlowingStarIcons[i]->hide();
					mFadedStarIcons[i]->show();
				}
			} else {
				mGlowingStarIcons[i]->hide();
				mFadedStarIcons[i]->hide();
			}
		}
	}
	void setActiveMapNo(WorldMapName id)
	{
		int curr, max;
		if (id == WM_NULL) {
			max = curr = 0;
		} else if (playerState) {
			switch (id) {
			case WM_Practice:
				max  = MAX_PARTS_PRACTICE;
				curr = playerState->getPartsGetCount(WM_Practice);
				break;
			case WM_Forest:
				max  = MAX_PARTS_FOREST;
				curr = playerState->getPartsGetCount(WM_Forest);
				break;
			case WM_Cave:
				max  = MAX_PARTS_CAVE;
				curr = playerState->getPartsGetCount(WM_Cave);
				break;
			case WM_Yakushima:
				max  = MAX_PARTS_YAKUSHIMA;
				curr = playerState->getPartsGetCount(WM_Yakushima);
				break;
			case WM_Last:
				max  = MAX_PARTS_LAST;
				curr = playerState->getPartsGetCount(WM_Last);
				break;
			default:
				max  = 0;
				curr = 0;
				break;
			}
		} else {
			switch (id) {
			case WM_Practice:
				max  = MAX_PARTS_PRACTICE;
				curr = 1;
				break;
			case WM_Forest:
				max  = MAX_PARTS_FOREST;
				curr = 2;
				break;
			case WM_Cave:
				max  = MAX_PARTS_CAVE;
				curr = 3;
				break;
			case WM_Yakushima:
				max  = MAX_PARTS_YAKUSHIMA;
				curr = 4;
				break;
			case WM_Last:
				max  = MAX_PARTS_LAST;
				curr = 0;
				break;
			default:
				max  = 0;
				curr = 0;
				break;
			}
		}

		setDisplayParts(max, curr);
	}

	// DLL:
	void init(P2DScreen* dataScreen)
	{
		char partStr[8];
		int partCount = 0;
		sprintf(partStr, "pa%02d", 0);
		while (dataScreen->search(P2DPaneLibrary::makeTag(partStr), false)) {
			sprintf(partStr, "pa%02d", ++partCount);
		}

		mMaxPartCount     = partCount;
		mFadedStarIcons   = new P2DPicture*[mMaxPartCount];
		mGlowingStarIcons = new P2DPicture*[mMaxPartCount];

		for (int i = 0; i < mMaxPartCount; i++) {
			sprintf(partStr, "pn%02d", i);
			P2DPane* pane = dataScreen->search(P2DPaneLibrary::makeTag(partStr), true);
			if (pane->getTypeID() == PANETYPE_Picture) {
				mFadedStarIcons[i] = (P2DPicture*)pane;
				mFadedStarIcons[i]->show();
				P2DPaneLibrary::changeParent(mFadedStarIcons[i], P2DPaneLibrary::getParentPane(mFadedStarIcons[i]));
			} else {
				PRINT("not picture pane.\n");
				ERROR("not picture pane.\n");
			}

			sprintf(partStr, "pa%02d", i);
			pane = dataScreen->search(P2DPaneLibrary::makeTag(partStr), true);
			if (pane->getTypeID() == PANETYPE_Picture) {
				mGlowingStarIcons[i] = (P2DPicture*)pane;
				mGlowingStarIcons[i]->show();
				P2DPaneLibrary::changeParent(mGlowingStarIcons[i], P2DPaneLibrary::getParentPane(mGlowingStarIcons[i]));
			} else {
				PRINT("not picture pane.\n");
				ERROR("not picture pane.\n");
			}
		}

		init();
	}
	void init() { }
	void update() { }

	// DLL inlines to do:
	void close();

	int mMaxPartCount;              // _00
	P2DPicture** mFadedStarIcons;   // _04
	P2DPicture** mGlowingStarIcons; // _08
};

/**
 * @brief TODO
 *
 * @note Size: 0x88.
 */
struct WorldMapConfirmMgr {
	/**
	 * @brief TODO
	 */
	enum statusFlag {
		STATUS_Unk0 = 0,
	};

	/**
	 * @brief TODO
	 */
	enum selectFlag {
		SELECT_Unk0 = 0,
		SELECT_Unk1 = 1,
		SELECT_COUNT, // 2
	};

	WorldMapConfirmMgr()
	{
		mConfirmScreen = new DrawScreen("screen/blo/w_ok.blo", nullptr, true, true);

		P2DScreen* confScreen = mConfirmScreen->getScreenPtr();
		confScreen->setOffset(mConfirmScreen->getScreenPtr()->getWidth() >> 1, mConfirmScreen->getScreenPtr()->getHeight() >> 1);
		P2DPane* parent = confScreen->search('pall', true);
		P2DPane* pane   = confScreen->search('se_c', true);
		if (pane->getTypeID() == PANETYPE_TextBox) {
			static_cast<P2DTextBox*>(pane)->getFontColor(_68, _6C);
		} else {
			ERROR("tag<se_c> pane is not text box.\n");
		}

		mMenuItems = new DrawMenuItem[SELECT_COUNT];

		for (int i = 0; i < SELECT_COUNT; i++) {
			char str[8];
			sprintf(str, "he%02d", i);
			pane = confScreen->search(P2DPaneLibrary::makeTag(str), true);
			P2DPaneLibrary::changeParent(pane, parent);
			mMenuItems[i].setTextPane(pane, nullptr);

			sprintf(str, "i%02dl", i);
			pane = confScreen->search(P2DPaneLibrary::makeTag(str), true);
			if (mMenuItems[i].setIconLPane(pane, parent)) {
				ERROR("pane [%s] is not picture.\n", str);
			}

			sprintf(str, "i%02dr", i);
			pane = confScreen->search(P2DPaneLibrary::makeTag(str), true);
			if (mMenuItems[i].setIconRPane(pane, parent)) {
				ERROR("pane [%s] is not picture.\n", str);
			}
		}

		mLeftSpecCursor.init(confScreen, parent, 'z**l', 10.0f, 100.0f);
		mRightSpecCursor.init(confScreen, parent, 'z**r', 50.0f, 100.0f);
		init();
	}

	void init(statusFlag status)
	{
		mStatus = status;
		mConfirmScreen->getScreenPtr()->move(640, 0);
		mConfirmScreen->getScreenPtr()->setScale(1.0f);
		mConfirmScreen->getScreenPtr()->show();
		_70               = 0.0f;
		mCurrentSelection = SELECT_Unk0;
		mLeftSpecCursor.initPos(mMenuItems[mCurrentSelection].getIconLPosH(), mMenuItems[mCurrentSelection].getIconLPosV());
		mRightSpecCursor.initPos(mMenuItems[mCurrentSelection].getIconRPosH(), mMenuItems[mCurrentSelection].getIconRPosV());

		for (int i = 0; i < SELECT_COUNT; i++) {
			mMenuItems[i].init(i == mCurrentSelection, _68, _6C);
		}
	}

	bool modeOperation(Controller*);

	// DLL:
	void init() { init(STATUS_Unk0); }

	void draw(Graphics&) { mConfirmScreen->draw(); }

	// DLL inlines to do:
	bool update(Controller*);
	selectFlag getSelectFlag();
	void start();

	DrawScreen* mConfirmScreen;         // _00
	SpectrumCursorMgr mLeftSpecCursor;  // _04
	SpectrumCursorMgr mRightSpecCursor; // _34
	DrawMenuItem* mMenuItems;           // _64
	Colour _68;                         // _68
	Colour _6C;                         // _6C
	f32 _70;                            // _70
	statusFlag mStatus;                 // _74
	selectFlag mCurrentSelection;       // _78
	Vector3f _7C;                       // _7C
};

} // namespace zen

const int zen::WorldMapTitleMgr::OBJ_NUM = 5;

// probably need to move these around later for ordering
f32 zen::WorldMapCursorOnyon::bottomLengthMin     = 10.0f;
f32 zen::WorldMapCursorOnyon::bottomLengthDefault = 15.0f;
f32 zen::WorldMapCursorOnyon::bottomLengthMax     = 20.0f;
f32 zen::WorldMapCursorOnyon::scaleFrameMax       = 0.8f;

const f32 zen::WorldMapCursorMgr::ONYON_POS_RADIUS = 60.0f;
const f32 zen::WorldMapCursorMgr::ONYON_OFFSET_X   = 0.0f;
const f32 zen::WorldMapCursorMgr::ONYON_OFFSET_Y   = 20.0f;
const f32 zen::WorldMapCursorMgr::ONYON_OFFSET_Z   = 0.0f;

const int WorldMapCoursePoint::EVENT_NONE          = 0;
const int WorldMapCoursePoint::EVENT_APPEAR_FINISH = 1;

/*
 * --INFO--
 * Address:	........
 * Size:	000040
 */
zen::DrawWorldMap::~DrawWorldMap()
{
}

/*
 * --INFO--
 * Address:	801DB14C
 * Size:	00246C
 */
zen::DrawWorldMap::DrawWorldMap()
{
	// SET UP EFFECTS MGR
