#include "jaudio/pikiinter.h"

#include "jaudio/jammain_2.h"
#include "jaudio/cmdqueue.h"
#include "jaudio/cmdstack.h"
#include "jaudio/interface.h"
#include "jaudio/piki_player.h"
#include "jaudio/pikidemo.h"
#include "jaudio/verysimple.h"
#include "jaudio/piki_bgm.h"
#include "jaudio/filter3d.h"

// rename better later
typedef struct SEvent_UnkC {
	u32 statusIdx;  // _00, unknown
	u8 actionGroup; // _04
	u32 timeStamp;  // _08, unknown
} SEvent_UnkC;

/**
 * @brief TODO
 *
 * @note Size: 0x1B4.
 */
typedef struct SEvent_ {
	SVector_ position;             // _00
	SEvent_UnkC statusEntries[16]; // _0C
	u32 eventType;                 // _CC
	seqp_* track;                  // _D0
	CmdQueue cmdQueue;             // _D4
	SEvent_* selfRef;              // _140
	int portArgs;                  // _144
	u8 _148[0x160 - 0x148];        // _148, unknown
	f32 volume;                    // _160
	f32 pan;                       // _164
	u8 _168[0x170 - 0x168];        // _168, unknown
	int frameTimer;                // _170
	OuterParam_ outerParam;        // _174
} SEvent_;

// fabricated name, need something for the CAMERA .comm entry
// size 0x24.
typedef struct SCamera_ {
	u8 pad[0x24]; // _00
} SCamera_;

typedef struct Portargs_ {
	SEvent_* mEvent; // _00
} Portargs_;

static int CURRENT_TIME;
static int jac_debug_multi_entry;
static int jac_debug_multi_cancel;
SEvent_ EVENT[16];
SCamera_ CAMERA;

typedef struct ActionStatus ActionStatus;
static int EVENT_OFFSET[] = { 0, 1, 0xad, 0xbe, 0xcd, 0xd7, 0xdb, 0x105 };
static struct ActionStatus {
	u8 flags; // _00
	u8 prio;  // _01
	u8 group; // _02
	u16 cmd;  // _03
} ACTION_STATUS[] = {
	{ 0x00, 0x00, 0x00, 0x00 },  { 0x00, 0x01, 0x00, 0x01 },  { 0x10, 0x00, 0x01, 0x02 },  { 0x00, 0x00, 0x01, 0x03 },
	{ 0x00, 0x00, 0x01, 0x04 },  { 0x00, 0x00, 0x01, 0x05 },  { 0x10, 0x00, 0x01, 0x06 },  { 0x10, 0x00, 0x01, 0x07 },
	{ 0x10, 0x00, 0x01, 0x08 },  { 0x10, 0x00, 0x01, 0x09 },  { 0x10, 0x00, 0x01, 0xE5 },  { 0x10, 0x00, 0x02, 0x0A },
	{ 0x00, 0x00, 0x02, 0x0B },  { 0x00, 0x00, 0x02, 0x0C },  { 0x00, 0x00, 0x02, 0x0D },  { 0x00, 0x00, 0x02, 0x0E },
	{ 0x00, 0x00, 0x02, 0x0F },  { 0x00, 0x00, 0x02, 0x10 },  { 0x00, 0x00, 0x02, 0x11 },  { 0x00, 0x00, 0x02, 0x12 },
	{ 0x00, 0x00, 0x02, 0x13 },  { 0x00, 0x00, 0x02, 0xD6 },  { 0x00, 0x00, 0x02, 0xD7 },  { 0x32, 0x00, 0x03, 0x14 },
	{ 0x32, 0x00, 0x03, 0x15 },  { 0x32, 0x00, 0x03, 0x16 },  { 0x34, 0x00, 0x03, 0x17 },  { 0x34, 0x00, 0x03, 0x18 },
	{ 0x34, 0x00, 0x03, 0x19 },  { 0x34, 0x00, 0x03, 0x29 },  { 0x10, 0x00, 0x04, 0x1A },  { 0x34, 0x00, 0x03, 0x1B },
	{ 0x34, 0x03, 0x04, 0x1C },  { 0x00, 0x00, 0x05, 0x1D },  { 0x00, 0x00, 0x05, 0x1E },  { 0x00, 0x00, 0x05, 0x1F },
	{ 0x00, 0x00, 0x05, 0x20 },  { 0x00, 0x00, 0x05, 0x21 },  { 0x00, 0x00, 0x05, 0x22 },  { 0x00, 0x00, 0x05, 0x23 },
	{ 0x10, 0x00, 0x05, 0xE6 },  { 0x00, 0x00, 0x08, 0x27 },  { 0x00, 0x01, 0x09, 0x28 },  { 0x00, 0x00, 0x09, 0x2A },
	{ 0x00, 0x00, 0x09, 0x103 }, { 0x00, 0x00, 0x09, 0x104 }, { 0x00, 0x00, 0x09, 0x105 }, { 0x14, 0x00, 0x03, 0x2B },
	{ 0x00, 0x01, 0x03, 0x2C },  { 0x00, 0x00, 0x07, 0x25 },  { 0x00, 0x00, 0x07, 0x26 },  { 0x10, 0x00, 0x07, 0x2D },
	{ 0x00, 0x02, 0x07, 0x2E },  { 0x10, 0x01, 0x07, 0x2F },  { 0x00, 0x00, 0x06, 0x24 },  { 0x00, 0x00, 0x06, 0x50 },
	{ 0x00, 0x00, 0x06, 0x51 },  { 0x00, 0x00, 0x06, 0x52 },  { 0x00, 0x00, 0x06, 0x53 },  { 0x00, 0x00, 0x06, 0x54 },
	{ 0x00, 0x00, 0x06, 0x55 },  { 0x00, 0x00, 0x06, 0x56 },  { 0x00, 0x00, 0x06, 0x57 },  { 0x00, 0x02, 0x07, 0x58 },
	{ 0x00, 0x01, 0x07, 0x59 },  { 0x10, 0x00, 0x08, 0x5A },  { 0x00, 0x00, 0x07, 0x5B },  { 0x00, 0x00, 0x08, 0x5C },
	{ 0x00, 0x00, 0x08, 0x5D },  { 0x00, 0x00, 0x08, 0x5E },  { 0x12, 0x00, 0x09, 0x60 },  { 0x12, 0x00, 0x09, 0x61 },
	{ 0x00, 0x00, 0x0A, 0x62 },  { 0x00, 0x00, 0x0A, 0x63 },  { 0x00, 0x00, 0x0A, 0x64 },  { 0x00, 0x01, 0x0A, 0x65 },
	{ 0x00, 0x01, 0x0A, 0x66 },  { 0x12, 0x00, 0x09, 0x67 },  { 0x00, 0x02, 0x0A, 0x68 },  { 0x00, 0x03, 0x0A, 0x69 },
	{ 0x10, 0x00, 0x0B, 0x6A },  { 0x00, 0x00, 0x0B, 0x6B },  { 0x00, 0x00, 0x0B, 0x6C },  { 0x00, 0x00, 0x0B, 0x6D },
	{ 0x00, 0x00, 0x0B, 0x6E },  { 0x10, 0x00, 0x0B, 0x6F },  { 0x10, 0x00, 0x0B, 0x70 },  { 0x10, 0x00, 0x0B, 0x71 },
	{ 0x00, 0x00, 0x0B, 0x72 },  { 0x00, 0x01, 0x0B, 0x73 },  { 0x00, 0x02, 0x0B, 0x74 },  { 0x00, 0x03, 0x0B, 0x75 },
	{ 0x00, 0x04, 0x0B, 0x76 },  { 0x00, 0x04, 0x0B, 0x107 }, { 0x00, 0x00, 0x0C, 0x78 },  { 0x00, 0x01, 0x0C, 0x79 },
	{ 0x10, 0x00, 0x0B, 0x7A },  { 0x10, 0x00, 0x0B, 0x7B },  { 0x10, 0x00, 0x0B, 0x7C },  { 0x10, 0x00, 0x0B, 0x7D },
	{ 0x00, 0x03, 0x0C, 0x7E },  { 0x00, 0x02, 0x0C, 0xE9 },  { 0x00, 0x04, 0x0C, 0xE8 },  { 0x00, 0x01, 0x0D, 0x82 },
	{ 0x00, 0x02, 0x0D, 0x83 },  { 0x00, 0x00, 0x0D, 0x84 },  { 0x00, 0x00, 0x0E, 0x86 },  { 0x00, 0x00, 0x0E, 0x87 },
	{ 0x00, 0x01, 0x0E, 0x88 },  { 0x00, 0x00, 0x0E, 0x89 },  { 0x00, 0x00, 0x0E, 0x8A },  { 0x04, 0x00, 0x03, 0x8C },
	{ 0x04, 0x00, 0x03, 0x8D },  { 0x00, 0x00, 0x0F, 0xC0 },  { 0x00, 0x00, 0x0F, 0xC1 },  { 0x00, 0x00, 0x0F, 0x1D },
	{ 0x00, 0x00, 0x0F, 0x20 },  { 0x00, 0x00, 0x0F, 0x119 }, { 0x00, 0x00, 0x0F, 0x23 },  { 0x00, 0x00, 0x0F, 0x11A },
	{ 0x00, 0x00, 0x0F, 0x11B }, { 0x00, 0x00, 0x10, 0xC2 },  { 0x00, 0x00, 0x10, 0xC3 },  { 0x00, 0x01, 0x11, 0xC4 },
	{ 0x00, 0x00, 0x12, 0xC5 },  { 0x00, 0x00, 0x12, 0xC6 },  { 0x00, 0x02, 0x11, 0xE7 },  { 0x00, 0x00, 0x13, 0xC7 },
	{ 0x00, 0x00, 0x13, 0xC8 },  { 0x00, 0x00, 0x13, 0xC9 },  { 0x00, 0x01, 0x13, 0xD5 },  { 0x00, 0x00, 0x14, 0xCA },
	{ 0x00, 0x00, 0x15, 0xCB },  { 0x00, 0x00, 0x15, 0xCC },  { 0x00, 0x00, 0x15, 0xCD },  { 0x00, 0x00, 0x15, 0xCE },
	{ 0x00, 0x00, 0x15, 0xCF },  { 0x00, 0x00, 0x16, 0xD0 },  { 0x00, 0x00, 0x16, 0xD1 },  { 0x00, 0x00, 0x16, 0x106 },
	{ 0x00, 0x01, 0x17, 0xD2 },  { 0x00, 0x02, 0x17, 0xD3 },  { 0x00, 0x01, 0x18, 0xD4 },  { 0x00, 0x00, 0x17, 0x114 },
	{ 0x20, 0x00, 0x18, 0xE0 },  { 0x00, 0x01, 0x19, 0xE1 },  { 0x00, 0x02, 0x19, 0xE2 },  { 0x00, 0x03, 0x19, 0xE3 },
	{ 0x00, 0x04, 0x19, 0xE4 },  { 0x00, 0x00, 0x19, 0x115 }, { 0x00, 0x00, 0x19, 0x116 }, { 0x00, 0x00, 0x19, 0x117 },
	{ 0x00, 0x01, 0x1A, 0x118 }, { 0x00, 0x00, 0x1A, 0xF0 },  { 0x00, 0x00, 0x1A, 0xF1 },  { 0x00, 0x00, 0x1A, 0xF2 },
	{ 0x00, 0x00, 0x1A, 0xF3 },  { 0x00, 0x00, 0x1A, 0xF4 },  { 0x00, 0x00, 0x1A, 0xF5 },  { 0x00, 0x00, 0x1B, 0xF6 },
	{ 0x00, 0x00, 0x1B, 0xF7 },  { 0x00, 0x00, 0x1B, 0xF8 },  { 0x00, 0x00, 0x1B, 0xF9 },  { 0x00, 0x00, 0x1B, 0xFA },
	{ 0x00, 0x01, 0x1C, 0xFE },  { 0x00, 0x00, 0x1C, 0xFB },  { 0x00, 0x00, 0x1C, 0xFC },  { 0x00, 0x01, 0x1C, 0xFD },
	{ 0x00, 0x00, 0x1D, 0xFF },  { 0x00, 0x00, 0x1D, 0x100 }, { 0x00, 0x00, 0x1D, 0x113 }, { 0x20, 0x00, 0x1E, 0x101 },
	{ 0x12, 0x01, 0x1E, 0x102 }, { 0x00, 0x01, 0x05, 0x40 },  { 0x20, 0x02, 0x05, 0x41 },  { 0x14, 0x00, 0x06, 0x42 },
	{ 0x00, 0x03, 0x07, 0x1A },  { 0x00, 0x01, 0x09, 0x4E },  { 0x00, 0x01, 0x09, 0x4F },  { 0x20, 0x01, 0x08, 0x43 },
	{ 0x20, 0x01, 0x08, 0x44 },  { 0x20, 0x01, 0x08, 0x45 },  { 0x20, 0x01, 0x08, 0x46 },  { 0x20, 0x01, 0x08, 0x47 },
	{ 0x20, 0x01, 0x08, 0x48 },  { 0x20, 0x01, 0x08, 0x49 },  { 0x20, 0x01, 0x08, 0x4A },  { 0x20, 0x01, 0x08, 0x4B },
	{ 0x20, 0x01, 0x08, 0x4C },  { 0x20, 0x01, 0x08, 0x4D },  { 0x10, 0x01, 0x07, 0x30 },  { 0x10, 0x03, 0x07, 0x31 },
	{ 0x14, 0x00, 0x08, 0x32 },  { 0x14, 0x00, 0x08, 0x33 },  { 0x14, 0x00, 0x08, 0x34 },  { 0x14, 0x00, 0x08, 0x35 },
	{ 0x14, 0x00, 0x08, 0x36 },  { 0x14, 0x01, 0x09, 0x37 },  { 0x14, 0x01, 0x09, 0x38 },  { 0x14, 0x00, 0x08, 0x39 },
	{ 0x14, 0x00, 0x08, 0x90 },  { 0x10, 0x02, 0x07, 0x3A },  { 0x10, 0x00, 0x07, 0x3B },  { 0x00, 0x04, 0x07, 0x112 },
	{ 0x14, 0x01, 0x07, 0x3C },  { 0x34, 0x00, 0x03, 0x2B },  { 0x00, 0x01, 0x04, 0x2C },  { 0x34, 0x00, 0x03, 0x1B },
	{ 0x34, 0x00, 0x03, 0x8B },  { 0x00, 0x00, 0x04, 0x91 },  { 0x34, 0x00, 0x03, 0x2B },  { 0x13, 0x00, 0x03, 0xDD },
	{ 0x13, 0x01, 0x03, 0xDE },  { 0x12, 0x00, 0x03, 0xDF },  { 0x00, 0x01, 0x05, 0xEA },  { 0x00, 0x00, 0x03, 0x90 },
	{ 0x32, 0x00, 0x04, 0xD9 },  { 0x00, 0x00, 0x04, 0x29 },  { 0x00, 0x00, 0x04, 0x8F },  { 0x20, 0x01, 0x05, 0xA0 },
	{ 0x20, 0x00, 0x01, 0xA1 },  { 0x20, 0x00, 0x04, 0xA2 },  { 0x20, 0x00, 0x01, 0xA3 },  { 0x20, 0x02, 0x04, 0xA4 },
	{ 0x20, 0x02, 0x04, 0xA5 },  { 0x20, 0x02, 0x04, 0xA6 },  { 0x20, 0x00, 0x01, 0xA7 },  { 0x20, 0x00, 0x01, 0xA8 },
	{ 0x20, 0x00, 0x01, 0xA9 },  { 0x20, 0x00, 0x01, 0xAA },  { 0x20, 0x00, 0x01, 0xAB },  { 0x20, 0x00, 0x01, 0xAC },
	{ 0x20, 0x00, 0x01, 0xAD },  { 0x20, 0x00, 0x01, 0xAE },  { 0x20, 0x00, 0x01, 0xAF },  { 0x20, 0x00, 0x01, 0xB0 },
	{ 0x20, 0x00, 0x01, 0xB1 },  { 0x20, 0x00, 0x01, 0xB2 },  { 0x20, 0x00, 0x01, 0xB3 },  { 0x20, 0x00, 0x01, 0xB4 },
	{ 0x20, 0x00, 0x01, 0xB5 },  { 0x20, 0x00, 0x01, 0xB6 },  { 0x20, 0x02, 0x03, 0xB7 },  { 0x20, 0x00, 0x01, 0xB8 },
	{ 0x20, 0x00, 0x01, 0xB9 },  { 0x20, 0x00, 0x01, 0xBA },  { 0x20, 0x01, 0x04, 0xBB },  { 0x20, 0x01, 0x03, 0xBC },
	{ 0x20, 0x01, 0x04, 0xBD },  { 0x20, 0x01, 0x02, 0x35 },  { 0x00, 0x00, 0x02, 0x15 },  { 0x00, 0x00, 0x02, 0x16 },
	{ 0x00, 0x00, 0x02, 0x17 },  { 0x00, 0x00, 0x02, 0x18 },  { 0x00, 0x00, 0x02, 0x32 },  { 0x00, 0x00, 0x02, 0x33 },
	{ 0x00, 0x00, 0x02, 0x34 },  { 0x00, 0x00, 0x02, 0x36 },  { 0x00, 0x00, 0x02, 0x39 },  { 0x00, 0x00, 0x02, 0x90 },
	{ 0x20, 0x00, 0x00, 0x00 },  { 0x10, 0x00, 0x07, 0x92 },  { 0x10, 0x00, 0x07, 0x93 },  { 0x10, 0x00, 0x07, 0x94 },
	{ 0x10, 0x00, 0x07, 0x95 },  { 0x00, 0x0C, 0x08, 0xDA },  { 0x10, 0x00, 0x0B, 0xDB },  { 0x00, 0x0C, 0x08, 0xDC },
	{ 0x12, 0x00, 0x0B, 0x108 }, { 0x20, 0x00, 0x0A, 0x109 }, { 0x00, 0x00, 0x0C, 0x10A }, { 0x00, 0x00, 0x0A, 0x10B },
	{ 0x00, 0x00, 0x0A, 0x10C }, { 0x20, 0x00, 0x0D, 0x10D }, { 0x00, 0x00, 0x0A, 0x10E }, { 0x00, 0x00, 0x0A, 0x10F },
	{ 0x00, 0x00, 0x0A, 0x110 }, { 0x00, 0x00, 0x0A, 0x111 },
};
static f32 EVENT_DIST_SCALE[8] = { 1.0f, 1.0f, 2.0f, 0.8f, 1.2f, 1.0f, 1.2f, 2.0f };

/*
 * --INFO--
 * Address:	........
 * Size:	00003C
 */
void Jac_Debug_ActionEntry(void)
{
	// UNUSED FUNCTION
}

/*
 * --INFO--
 * Address:	800175E0
 * Size:	000048
 */
void __SetVolandPan(Portargs_* arg)
{
	SEvent_* evt;
	seqp_* track;

	evt   = arg->mEvent;
	track = evt->track;
	Jam_SetExtParam(evt->volume, track, 1);
	track = evt->track;
	Jam_SetExtParam(evt->pan, track, 8);
}

/*
 * --INFO--
 * Address:	80017640
 * Size:	000048
 */
void SendToStack(SEvent_* evt)
{
	evt->selfRef = evt;
	Set_Portcmd(&evt->portArgs, (int)__SetVolandPan, (int)&evt->selfRef);
	Add_PortcmdOnce((u32*)&evt->portArgs);
}

/*
 * --INFO--
 * Address:	800176A0
 * Size:	0000EC
 */
void Jac_InitEventSystem(void)
{
	seqp_* handle;
	u32 i;
	u32 j;

	Jac_SetProcessStatus(10);
	CURRENT_TIME = 0;

	do {
		handle = Jam_GetTrackHandle(0x20000);
	} while (handle == NULL);

	for (i = 0; i < 16; i++) {
		EVENT[i].eventType = 0;
		EVENT[i].track     = handle->children[i];

		Jam_InitExtBuffer(&EVENT[i].outerParam);
		Jam_AssignExtBuffer(handle->children[i], &EVENT[i].outerParam);
		Jam_OnExtSwitch(handle->children[i], 9);

		Jal_AddCmdQueue(&EVENT[i].cmdQueue, EVENT[i].track, 0);

		for (j = 0; j < 16; j++) {
			EVENT[i].statusEntries[j].statusIdx   = 0;
			EVENT[i].statusEntries[j].actionGroup = 0;
			EVENT[i].statusEntries[j].timeStamp   = 0;
		}
	}

	Jac_SetProcessStatus(11);
}

/*
 * --INFO--
 * Address:	800177A0
 * Size:	0000BC
 */
void Jac_EventFrameCheck(void)
{
	u32 i, j;
	SEvent_* event;
	if (Jac_DemoCheck()) {
		return;
	}
	if (Jac_PauseCheck()) {
		return;
	}

	for (i = 0; i < 16; i++) {
		event = &EVENT[i];
		if (!event->eventType) {
			continue;
		}
		if (!event->frameTimer) {
			continue;
		}
		event->frameTimer--;
		if (event->frameTimer) {
			continue;
		}
		for (j = 0; j < 16; j++) {
			event->statusEntries[i].statusIdx = 0;
		}

		Jal_SendCmdQueue_Force(&event->cmdQueue, 0xFFFF);
	}
}

/*
 * --INFO--
 * Address:	80017860
 * Size:	00013C
 */
void Jac_UpdateCamera(struct SVector_* p1, struct SVector_* p2)
{
	SEvent_* event;
	u32 i;
	u8 set = FALSE;
	f32 dist;
	f32 dist2;

	CURRENT_TIME++;

	for (i = 0; i < 16; i++) {
		event = &EVENT[i];
		if (event->eventType == 0) {
			continue;
		}

		dist  = EVENT_DIST_SCALE[event->eventType];
		dist2 = V3D_Abs((Vector3D_*)&event->position);
		dist2 = dist2 * dist;
		if (dist2 > 1.0f) {
			dist2 = 1.0f;
		}
		dist  = 1.0f - dist2;
		dist2 = V3D_GetAngle((Vector3D_*)&event->position);
		if (dist2 >= 3.1416f) {
			dist2 = -6.2832f + dist2;
		}
		dist2 = 0.5f + (-dist2 / 3.1416f);
		if (dist2 > 1.0f) {
			dist2 = 2.0f - dist2;
		}
		if (dist2 < 0.0f) {
			dist2 = -dist2;
		}
		event->volume = dist;
		event->pan    = dist2;
		if (dist >= 0.8f && event->eventType == 1) {
			set = TRUE;
		}
		SendToStack(&EVENT[i]);
	}

	Jac_SetBgmModeFlag(0, 1, set);
	Jac_UpdatePikiGaya();
}

/*
 * --INFO--
 * Address:	800179A0
 * Size:	000118
 */
int Jac_CreateEvent(u32 eventType, struct SVector_* p2)
{
	u32 i;
	u32 idx;
	SEvent_* event;
	u32* REF_p1 = &eventType;
	if (!eventType) {
		return -1;
	}

	if (!Jac_DemoCheckEvent(eventType)) {
		return -1;
	}

	for (i = 0; i < 16; i++) {
		event = &EVENT[i];
		if (!event->eventType) {
			break;
		}
	}

	if (i == 16) {
		return -1;
	}

	idx = i;

	event            = &EVENT[idx];
	event->eventType = eventType;

	event->position.x = p2->x;
	event->position.y = p2->z;
	event->position.z = p2->y;

	for (i = 0; i < 16; i++) {
		event->statusEntries[i].timeStamp = event->statusEntries[i].actionGroup = event->statusEntries[i].statusIdx = 0;
	}

	event->frameTimer = 100;

	switch (eventType) {
	case 7:
		Jac_PlayEventAction(idx, 4);
		break;
	}

	return idx;
}

/*
 * --INFO--
 * Address:	80017AC0
 * Size:	00005C
 */
BOOL Jac_UpdateEventPosition(int idx, struct SVector_* p2)
{
	if (idx == -1) {
		return FALSE;
	}

	if (!EVENT[idx].eventType) {
		return FALSE;
	}

	EVENT[idx].position   = *p2;
	EVENT[idx].frameTimer = 100;
	return TRUE;
}

/*
 * --INFO--
 * Address:	80017B20
 * Size:	0002E0
 */
BOOL Jac_PlayEventAction(int eventIdx, int actionId)
{
	u32 targetSlot;
	u8 lowestPrio;
	u8 group;
	u32 statusIdx;
	SEvent_* ev;
	u32 i;

	if (eventIdx == -1) {
		return FALSE;
	}

	ev = &EVENT[eventIdx];
	if (ev->eventType == 0) {
		return FALSE;
	}

	statusIdx = actionId + EVENT_OFFSET[ev->eventType];

	int usedSlots = 0;
	for (i = 0; i < 16; i++) {
		SEvent_UnkC* u = &ev->statusEntries[i];
		if (u->statusIdx == 0) {
			break;
		}
		usedSlots++;
	}

	targetSlot = usedSlots;

	lowestPrio = ACTION_STATUS[statusIdx].flags;
	group      = ACTION_STATUS[statusIdx].group;

	if (lowestPrio & 0x10) {
		u32 maxConcurrent = lowestPrio & 0xf;
		if (maxConcurrent == 0) {
			maxConcurrent = 0x10;
		}

		u32 concurrentCount = 0;
		u32 oldestTime      = 0;
		u32 oldestSlot      = 0;
		u32 currentPriority = ACTION_STATUS[statusIdx].prio;
		for (i = 0; i < 16; i++) {
			if (ev->statusEntries[i].statusIdx) {
				if (ev->statusEntries[i].actionGroup == group) {
					concurrentCount++;
				}

				u32 status4 = ACTION_STATUS[ev->statusEntries[i].statusIdx].prio;
				if (currentPriority > status4) {
					oldestTime      = CURRENT_TIME - ev->statusEntries[i].timeStamp;
					oldestSlot      = i;
					currentPriority = status4;
				}

				if (currentPriority == status4) {
					u32 slotAge = CURRENT_TIME - ev->statusEntries[i].timeStamp;
					if (slotAge > oldestTime) {
						oldestTime = slotAge;
						oldestSlot = i;
					}
				}
			}
		}

		if (concurrentCount >= maxConcurrent || targetSlot == 0x10) {
			if (lowestPrio & 0x20) {
				jac_debug_multi_cancel++;
				return 0;
			}

			targetSlot = oldestSlot;
		}
	} else {
		int firstFreeSlot = 16;
		for (i = 0; i < 16; i++) {
			u32 slotStatusIdx = ev->statusEntries[i].statusIdx;
			if (slotStatusIdx == 0) {
				firstFreeSlot = i;
				continue;
			}

			if (ev->statusEntries[i].actionGroup != group) {
				continue;
			}

			if (lowestPrio & 0x20) {
				if (ACTION_STATUS[statusIdx].prio > ACTION_STATUS[slotStatusIdx].prio) {
					targetSlot = i;
				} else {
					jac_debug_multi_cancel++;
					return 0;
				}
			} else {
				targetSlot = i;
			}
			break;
		}

		if (i == 16) {
			targetSlot = firstFreeSlot;
		}
	}

	if (targetSlot == 16) {
		lowestPrio = ACTION_STATUS[statusIdx].prio + 1;
		for (i = 0; i < 16; i++) {
			u8 slotPrio = ACTION_STATUS[ev->statusEntries[i].statusIdx].prio;
			if (ACTION_STATUS[ev->statusEntries[i].statusIdx].prio < lowestPrio) {
				lowestPrio = slotPrio;
				targetSlot = i;
			}
		}

		if (targetSlot == 16) {
			jac_debug_multi_cancel++;
			return FALSE;
		}
	}

	jac_debug_multi_entry++;
	Jal_SendCmdQueue_Force(&ev->cmdQueue, targetSlot << 0xc | ACTION_STATUS[statusIdx].cmd);
	ev->statusEntries[targetSlot].statusIdx   = statusIdx;
	ev->statusEntries[targetSlot].actionGroup = group;
	ev->statusEntries[targetSlot].timeStamp   = CURRENT_TIME;
	return TRUE;
}

/*
 * --INFO--
 * Address:	80017E00
 * Size:	0000BC
 */
BOOL Jac_StopEventAction(int a1, int a2)
{
	u32 i;
	SEvent_* event;
	if (a1 == -1) {
		return FALSE;
	}
	event = &EVENT[a1];
	if (event->eventType == 0) {
		return FALSE;
	}

	int offset = a2 + EVENT_OFFSET[event->eventType];
	for (i = 0; i < 16; i++) {
		SEvent_UnkC* c = &event->statusEntries[i];
		if (c->statusIdx == offset) {
			Jal_SendCmdQueue_Force(&event->cmdQueue, i * 0x1000);
			c->statusIdx = 0;
		}
	}
	return TRUE;
}

/*
 * --INFO--
 * Address:	80017EC0
 * Size:	000070
 */
BOOL MML_StopEventAction(u8 idx, u8 a2, u16 a3)
{
	if (EVENT[idx].eventType == 0) {
		return FALSE;
	}
	if (ACTION_STATUS[EVENT[idx].statusEntries[a2].statusIdx].cmd != a3) {
		return FALSE;
	}
	EVENT[idx].statusEntries[a2].statusIdx = 0;
	return TRUE;
}

/*
 * --INFO--
 * Address:	80017F40
 * Size:	00005C
 */
void MML_StopEventAll(u8 idx, u16 p2)
{
	u32 i;
	u16 flag = 1;
	if (EVENT[idx].eventType == 0) {
		return;
	}

	for (i = 0; i < 16; i++) {
		if ((p2 & flag) == 0) {
			EVENT[idx].statusEntries[i].statusIdx = 0;
		}
		flag = (flag << 1) & 0xFFFE;
	}
}

/*
 * --INFO--
 * Address:	80017FA0
 * Size:	000094
 */
BOOL Jac_DestroyEvent(s32 idx)
{
	u32 i;
	SEvent_* event;
	if (idx == -1) {
		return FALSE;
	}

	event = &EVENT[idx];
	if (event->eventType == 0) {
		return FALSE;
	}

	for (i = 0; i < 16; i++) {
		event->statusEntries[i].statusIdx = 0;
	}

	Jal_SendCmdQueue_Force(&event->cmdQueue, 0xFFFF);
	event->eventType = 0;
	return TRUE;
}

/*
 * --INFO--
 * Address:	80018040
 * Size:	00003C
 */
void Jac_InitAllEvent(void)
{
	u32 i;
	for (i = 0; i < 16; i++) {
		Jac_DestroyEvent(i);
	}
}

/*
 * --INFO--
 * Address:	........
 * Size:	000060
 */
void Jac_DestroyNotThisEvent(void)
{
	// UNUSED FUNCTION
}

/*
 * --INFO--
 * Address:	80018080
 * Size:	000038
 */
int Jac_CheckFreeEvents(void)
{
	u32 i;
	int count = 0;
	for (i = 0; i < 16; i++) {
		if (!EVENT[i].eventType) {
			count++;
		}
	}

	return count;
}

/*
 * --INFO--
 * Address:	800180C0
 * Size:	000050
 */
int Jac_GetActiveEvents(u32* eventIDs)
{
	u32 count = 0;
	u32 i;
	for (i = 0; i < 16; i++) {
		if (EVENT[i].eventType != 0) {
			eventIDs[count] = i;
			count++;
		}
	}

	return count;
}
